[

    
        {
            "title": "Tor Weekly News — February 11th, 2015",
            "content": "Welcome to the sixth issue in 2015 of Tor Weekly News, the weekly newsletter that covers what’s happening in the community around Tor, “your online an-onionising software”.\n\nThe 2015 Tor UX Sprint\n\nMany open-source privacy tools struggle with questions of usability: so much effort goes into ensuring they are secure that few resources are left over to work on the user experience. But as Linda Lee and David Fifield write, “usability is critical to security”: user interface issues “can degrade user experience, cause confusion, or even cause people to accidentally deanonymize themselves”.\n\nTo explore, and hopefully solve, some of these problems, a group of Tor developers, designers, users, and researchers met at UC Berkeley at the start of the month. As part of the weekend, users were asked to walk through the process of installing and running Tor Browser, noting aloud their assumptions and reactions as they went.\n\nIssues and “stopping points” (where users find the process too difficult to continue) discovered during these sessions were noted, and have been assigned tickets on Tor’s bug tracker. For more details of the event and its outcomes, please see Linda and David’s post; “if you are interested in helping to improve the usability of Tor Browser, get in touch by email or IRC”.\n\nTor and the Library Freedom Project\n\nAs Tor Weekly News reported last September, Massachusetts librarian and activist Alison Macrina has been leading a campaign to educate colleagues and library patrons on the state of digital surveillance and the use of privacy-preserving software such as Tor and Tails. As Alison and April Glaser wrote at the time, “libraries provide access to information and protect patrons’ right to explore new ideas, no matter how controversial or subversive”.\n\nThese initial workshops formed the basis for the Library Freedom Project, which has just received a grant from the Knight Foundation to expand its activities beyond the New England region. In a guest post on the Tor blog, Alison introduced the project, the motivations behind it, and its plans for the next few years, as well as suggesting some possible areas for collaboration with the Tor community in the future: “One specific way that librarians can help the Tor Project is with usability issues – we have lots of experience helping ordinary users with common usability problems […] Librarians can also run dev sprints, help update documentation, and generally advocate for tools that help safeguard privacy and anonymity.”\n\nFor more information on the Library Freedom Project, or to propose your own ideas, please see the project’s website. Thanks to Alison and colleagues for this important work!\n\nVidalia laid to rest\n\nNow that Vidalia, the graphical user interface for Tor, has been completely unmaintained ”for too long to be a recommended solution”, Sebastian Hahn has removed the last links to Vidalia-related content from the Tor Project website. If you are still using a version of Tor Browser (outside of Tails) that contains Vidalia, it is almost certainly too old to be safe, so please upgrade as soon as possible.\n\nVidalia is still shipped in the latest version of Tails, however, so the Tails team has been working on a simple interface to replace one of the most-missed features of the defunct program, the circuit visualization window. The Tor Browser team have already implemented a similar per-site circuit diagram in the current 4.5-alpha series, so there should soon be no reason at all for users to continue controlling their Tor through Vidalia.\n\nMore monthly status reports for January 2015\n\nThe wave of regular monthly reports from Tor project members for the month of January continued, with reports from George Kadianakis, Pearl Crescent, Michael Schloh von Bennewitz, Nick Mathewson, Karsten Loesing, and Arlo Breault.\n\nMike Perry reported on behalf of the Tor Browser team, and George Kadianakis sent out the report for SponsorR.\n\nMiscellaneous news\n\nGeorge Kadianakis linked to the technical report produced by the team working on statistics related to the amount of hidden service usage on the Tor network; Karsten Loesing added some more information regarding the fraction of network activity this represents. These are advanced calculations, so if you’re not experienced in data science but want to know more about this topic, the team will be back shortly with a more “casual-reader-friendly” analysis of the results.\n\n“Fresh off a round of real-world intensive testing and debugging using spotty 2.5G coverage in the foothills of the Himalayas”, Nathan Freitas of the ever-intrepid Guardian Project announced the first release candidate for version 14.1 of ChatSecure, the “most private” messaging client for Android and iOS, featuring numerous improvements to usability, stability, and network handling. Please see Nathan’s announcement for the full changelog.\n\nNathan also shared a “very early” incarnation of PLUTO, “a simplified means for developers to include traffic obfuscation capabilities into their applications” with initial support for obfs4 and meek. “We think many apps could utilize this approach to defeat DPI filtering, and that this would be useful to offer decoupled from the way Tor integrates it”.\n\nDavid Fifield posted a tutorial for configuring the meek pluggable transport to work with hard-to-block HTTPS websites interested in helping censored Tor users, rather than the large content delivery networks it currently uses, along with the regular summary of the costs incurred by meek’s infrastructure last month: “meek has so far been a smashing success. It’s the #2 pluggable transport behind obfs3 and it moved over 5 TB of traffic last month. But the costs are starting to get serious.” If you have ideas for supporting this vitally important anti-censorship tool, please see David’s message for more details.\n\nAlso in meek news, Across The Great FireWall published a Chinese-language introduction to the concepts underpinning this pluggable transport. Other resources (in Chinese and other languages) are listed on the wiki.\n\nNick Mathewson took to the Tor blog to explain exactly what Tor design proposals are for and how they are written, and offered status updates (and review recommendations) for some new and still-open proposals.\n\nNick also asked relay operators to contribute their advice to a relay hardening guide that could be shipped with Tor.\n\nArturo Filastò asked for help in coming up with a roadmap for the future of the Open Observatory of Network Interference, asking for opinions on a range of possible development, deployment, and research projects. Feel free to let the ooni-dev list know which of the ideas catches your attention.\n\nAfter soliciting feedback on including newer pluggable transports in Tails, the Tails team decided to focus on obfs4 and then (“tentatively”) meek for upcoming versions of the anonymous live operating system.\n\nTom “TvdW” van der Woerdt wrote a detailed report on his experience implementing a Tor client from scratch in the Go programming language, following Tor’s specification document. One instance of “GoTor” briefly broke the Tor relay speed record with 250 megabytes/second, but Tom ultimately decided that Go isn’t the right language for such a thing, as its library support doesn’t make it easy enough to do. Thanks to Tom for running the experiment, and catching some specification errors in the process!\n\nEven though Tor Browser is not vulnerable to the recent WebRTC IP attack proof-of-concept proof-of-concept, Mike Perry nevertheless invited “interested parties to try harder to bypass Tor in a stock Firefox using WebRTC and associated protocols (RTSP, SCTP) with media.peerconnection.enabled set to false”, before a plan to enable WebRTC-based QRCode bridge address resolution and sharing in Tor Launcher is implemented.\n\nShadow, the tool by Rob Jansen that allows full Tor network simulation, now has a new website. As Rob wrote: “The new website still uses the Jekyll engine, and is a stripped down customized version of the open source SOLID theme. Please send me feedback if you have it.”\n\nJillian York of the EFF discussed the problems of over-reliance on US government funding — and the dearth of other funding streams — for anti-surveillance tools, including Tor.\n\nSeven of the eleven activists arrested last year in Spain for, amongst other things, having had email accounts with the technical collective Riseup — longtime Tor allies and operators of one of the directory authorities — have been released from prison. As Riseup wrote following the arrests, “security is not a crime”: “Giving up your basic right to privacy for fear of being flagged as a terrorist is unacceptable.”\n\nEasy development tasks to get involved with\n\nTwo problems confronting Mac users who want to download Tor Browser are the “disk image” format and Apple’s Gatekeeper security system. If these users try to run Tor Browser directly from the disk image window that opens after downloading, they will receive an error telling them “Firefox is already running”, and if they correctly move the program to the Applications folder, Gatekeeper will prevent them from running it directly anyway.\n\nIf you have access to a machine running the latest version of Mac OS X, and want to spend ten minutes making life easier for Tor users, the Tor Browser download page would benefit from screenshots showing users how to drag the program to the Applications folder, and how to disable Gatekeeper by control-clicking on the Tor Browser icon when running for the first time. Please see the relevant bug ticket for a nice set of example screenshots; your contribution will be gratefully received!\n\n\n\nThis issue of Tor Weekly News has been assembled by Harmony, Roger Dingledine, Kate Krauss, and David Fifield.\n\nWant to continue reading TWN? Please help us create this newsletter. We still need more volunteers to watch the Tor community and report important news. Please see the project page, write down your name and subscribe to the team mailing list if you want to get involved!\n",
            "link": "http://tor.jmtodaro.com//tor-weekly-news-—-february-11th-2015",
            "date": "2015-02-11 01:00:00 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor Winter Dev Meeting 2015",
            "content": "https://trac.torproject.org/projects/tor/wiki/org/meetings/2015WinterDevMeeting\n",
            "link": "http://tor.jmtodaro.com//events/tor-winter-dev-meeting-2015",
            "date": "2015-02-10 01:00:00 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Roger and Jake at RightsCon in Manila",
            "content": "https://www.rightscon.org/manila/\n",
            "link": "http://tor.jmtodaro.com//events/roger-and-jake-rightscon-manila",
            "date": "2015-02-10 01:00:00 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "UX Sprint 2015 wrapup",
            "content": "Usability is critical to security. Additionally, there has been research on &quot;stopping points,&quot; common points where people would get frustrated with Tor enough that they would stop the installation process or stop using Tor. Usability issues also can degrade user experience, cause confusion, or even cause people to accidentally deanonymize themselves.\n\nTo address usability issues broadly, we brought together Tor developers, designers, users, and researchers to discuss usability problems and how to fix them. Last weekend, there was a user experience (UX) sprint dedicated to improving the usability of Tor Browser.\n\nA major part of the sprint was user testing the current Tor Browser (4.0.3). We asked users—some with prior Tor experience, some without—to perform some common tasks:\n\n\n  Search for, download, and install Tor Browser\n  Do a web search\n  Watch a video\n  Use &quot;New Identity&quot;\n  Interact with and describe the current browser toolbar buttons\n\n\nThe users performed this task in a &quot;cognitive walkthrough&quot; fashion, talking aloud while completing each of the tasks, explaining their understanding of the task and motivation for completing it in that specific way. With permission, we recorded the contents of the computer screen so developers could watch in another room. We hope to present the screen videos and other outcomes of the sprint at the upcoming winter dev meeting.\n\nBecause of the limited size of the study (there were five participants), it&#39;s not possible to state with confidence what fraction of users will encounter major usability obstacles. However, it was effective at discovering and demonstrating issues that are likely to cause problems for many users. We will use our observations to guide future experiments. A few aspects stood out as deserving of further attention:\n\n\nWhile searching for Tor Browser, users encountered various sources for the browser other than our target &quot;Easy Download&quot; page, and also found some odd sources for documentation. Users who found a download page other than the &quot;easy&quot; version expressed varying degrees of confusion, depending on their landing page. Ticket #14685 is about finding a way to consolidate or drive users to our preferred download page.\nGatekeeper on OS X makes it hard to install programs that aren&#39;t signed by an Apple certificate or don&#39;t come from the App Store. All users were at least temporarily delayed by this dialog:\n\n\n\nEven though everyone was able to get past the dialog, it was a big obstacle to installation. (If it happens to you, the trick is to Ctrl-click on the Tor Browser icon and select &quot;Open&quot;.) To solve this problem is not easy, but we can perhaps make it better by providing better documentation. Ticket #6540 tracks this issue.\nIf you try to run Tor Browser from a read-only filesystem, you get a misleading error message:\n\n\n\nThis is a known issue, tracked in ticket #4782, that affected some users. It happens on OS X if you run the Tor Browser app directly from the disk image (.dmg) instead of first copying it to the Applications folder.\n\n\nTickets created as a result of the sprint have the #uxsprint2015 tag. In addition, the new #tbb-usability-stoppoint tag marks stopping points, to help track usability issues like the above, which result in users being unable or unwilling to continue using the browser.\n\nWe hope that usability experiments and improvements will be ongoing. In the future, we&#39;d like to test other aspects of Tor Browser, such as downloading files, updating, and managing Tor and non-Tor browsers, as well as expanding the tests to larger and diverse user groups. If you are interested in helping improve the usability of Tor Browser, get in touch by email or IRC. We need help from a lot of different kinds of people: designers, translators, programmers, and usability experts to name a few.\n\nWe thank the Tor Project for supporting the sprint, the participants, those who helped us recruit on short notice, and those who helped us plan and set goals and everyone who attended as a developer or observer: Arlo, Arthur, Ashkan, David, Griffin, Isis, Krishna, Linda, Mike, and Nima. We also thank the Tor help desk, whose #tbb-helpdesk-frequent tag helped us prioritize tickets. Special thanks go to Nima for suggesting the idea of a UX meeting in the first place.\n\nLinda Lee and David Fifield\n",
            "link": "http://tor.jmtodaro.com//ux-sprint-2015-wrapup",
            "date": "2015-02-09 08:21:28 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Guest Post: The Library Freedom Project: Bringing privacy and anonymity to libraries",
            "content": "Hi, Tor community! My name is Alison, and I&#39;m the founder of the Library Freedom Project, an initiative that aims to make real the promise of intellectual freedom in libraries. It&#39;s a partnership among librarians, technologists, attorneys, and privacy advocates to teach librarians about surveillance threats, privacy rights, and privacy-protecting technology tools. So far, we&#39;ve been all over Massachusetts and parts of New England, and we have been awarded a generous grant from the Knight Foundation to bring privacy training to libraries across the United States.\n\nWe teach librarians three things. Kade Crockford of the ACLU of Massachusetts teaches the current state of digital surveillance. Jessie Rossman, an attorney and surveillance law expert also from the ACLU of Massachusetts, offers a privacy-focused “know your rights” training. I teach technology tools – like Tor and Tails .\n\nLibraries have historically been staunch defenders of privacy, taking public stands against surveillance initiatives like the USA PATRIOT Act. Libraries offer public internet terminals, and librarians like me teach free computer classes to the public. Our patrons come from all walks of life, but we tend to serve communities particularly vulnerable to surveillance (including immigrants, Muslim Americans, people of color, people who are homeless, and those who have been incarcerated) in higher numbers than in the general population. For all of these reasons, libraries are an obvious place to promote and protect online privacy and anonymity and fight against digital censorship and surveillance – that&#39;s why I started the Library Freedom Project.\n\nWhile we focus on US libraries, we are eager to speak to our colleagues in other countries, since privacy is a right for everyone in every country (and privacy is threatened everywhere).\n\nIn the tech part of my trainings, I teach tools like the Tor Browser, Tails, HTTPS Everywhere, and DuckDuckGo. I show librarians how to install these on public PCs, and provide curricula for librarians who want to teach privacy-focused computer classes. I help library staff configure Tor relays and set their library websites to run on HTTPS by default. They are thrilled to learn about these tools – as I said, librarians as a profession have always valued privacy, but the development of mass surveillance technologies has outpaced their technical ability. They want to protect their patrons, but they don&#39;t know where to start. Thanks to the tools developed by folks in the Tor community, I&#39;ve been able to teach librarians the skills they need to take anti-surveillance tools to the public. Librarians whom I&#39;ve trained have started teaching their own classes to library patrons, and the public response has been overwhelmingly positive and moving – these classes make a real difference in the lives of everyday people who are desperate to learn practical ways to take back their digital privacy. The work of the Tor community makes it possible for me and other librarians to help them do this.\n\nSo please allow me to express my heartfelt thanks for all that you do. Without tools developed by the Tor community, my work would not be possible. On a personal level, I&#39;m awed by how welcoming and helpful this community has been to me. Tor community folks have offered me feedback, encouragement, and assistance at every turn. Tor Project core member Nima Fatemi even helped build my website (thanks again Nima, I owe you big time!). Now that I run the Library Freedom Project full time, I look forward to working even more closely with folks from the Tor community, and I&#39;d love to give back to your community the way you&#39;ve given to mine. One specific way that librarians can help the Tor Project is with usability issues – we have lots of experience helping ordinary users with common usability problems. I&#39;d like to introduce developers to librarians who&#39;ve installed anonymity tools and other free software in their libraries. Librarians can also run dev sprints, help update documentation, and generally advocate for tools that help safeguard privacy and anonymity.\n\nWith Knight funding, our goal is to conduct 100 librarian trainings in two years, and build a website of resources for librarians who want to teach their communities how to protect themselves against online surveillance. I&#39;ll be traveling all over the US to do this, so please get in touch with me to see if I&#39;m coming to your city! I&#39;d love to bring Tor community members with me to my trainings and help develop a partnership between our two communities.\n\nFor more information about the Library Freedom Project, to get involved in the fight for digital civil liberties in libraries, or to offer your own ideas for how this project can move forward, visit our website or contact me.\n",
            "link": "http://tor.jmtodaro.com//guest-post-library-freedom-project-bringing-privacy-and-anonymity-libraries",
            "date": "2015-02-08 10:43:41 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor design proposals: how we make changes to our protocol",
            "content": "(This post is likely to be interesting for folks who want to know how the Tor software is made.)\n\nAt the core of the Tor software lies the network protocol that Tor relays and clients use to talk to each other. We try to make sure we have a good set of specification documents for the protocol at all times, so that other people can write compatible software that interoperates with Tor.\n\nOnce upon a time, we used to change these specification documents whenever we changed the software&#39;s behavior. That didn&#39;t go well. We would have changes in the spec that we had forgotten to make in the software, and tons of inline comments where we argued about whether a particular paragraph was a good idea.\n\nSo back in 2007, we introduced a lightweight change-proposal process: to make a change to the Tor protocol, you write up a little design document, and send it to the tor-dev mailing list. Once it meets editorial quality, it can go into the proposals repository. Once it&#39;s implemented, it can be merged into the spec.\n\nThere are a lot of proposals to look at, though. The current set of open proposals has almost 100,000 words in it! (That&#39;s almost half again as long as the Tor specs themselves.)\n\nTo help people navigate through this pile of design proposals, I started to write a regular &quot;proposal status&quot; email to explain what all of the open proposals are about. Last year, however, I fell out of the habit. Tonight, I&#39;ve tried to fall back in: here&#39;s the latest proposal status writeup.\n\nBelow the cut, my summaries of the still-open proposals that have been added in the past couple of year -- and thanks to all the busy designers who have been working to think of ways to improve Tor! read more »\n",
            "link": "http://tor.jmtodaro.com//tor-design-proposals-how-we-make-changes-our-protocol",
            "date": "2015-02-07 19:22:58 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor Weekly News — February 4th, 2015",
            "content": "Welcome to the fifth issue in 2015 of Tor Weekly News, the weekly newsletter that covers what’s happening in the Tor community.\n\nMozilla’s Tor relays go live\n\nLate last year, Mozilla announced its partnership with the Tor Project in the Polaris Privacy Initiative, a program aimed at “giving users more control, awareness and protection in their Web experiences”. One of the two Tor-related “experiments” Mozilla planned to carry out was the operation of several high-capacity middle relays, and last week Mozilla’s Network Engineering team announced that the new nodes had been running for several weeks, in a blog post that explores the technical decisions and challenges they faced in setting them up.\n\nThe team discussed the hardware and infrastructure chosen for the relays, configuration management using Ansible (publishing their playbook at the same time), and security practices, as well as announcing their intention to continue posting about their experiences and findings during the experiment.\n\nThanks to Mozilla for this contribution to the Tor network!\n\nMonthly status reports for January 2015\n\nThe wave of regular monthly reports from Tor project members for the month of January has begun. Juha Nurmi released his report first, followed by reports from Philipp Winter, Damian Johnson, Sherief Alaa, Georg Koppen, and David Goulet.\n\nMiscellaneous news\n\nmeejah announced version 0.12.0 of txtorcon, the Tor controller client in Twisted; please see the announcement for a full list of improvements.\n\nNick Mathewson submitted a draft of proposal 241, which aims to protect users against adversaries who are able to attack their connectivity to the Tor network and force them to use malicious guard nodes. Roger Dingledine offered some further thoughts.\n\nNick also set out the schedule for the Tor 0.2.6 feature freeze.\n\nAfter reports from users that Tor Browser’s default obfs4 bridges are no longer usable in China, David Fifield estimated the time it takes for the “Great Firewall” to react to new circumvention systems as lying “between 2 and 10 weeks”, and asked for additional data to narrow the range further.\n\nIsis Lovecruft “would be super stoked if we could make it as easy and seamless as possible for the bridge operators who are still running obfs2 (!!) to move to supporting better, newer pluggable transports”, such as obfs4, and wondered how to make it possible for operators running Debian stable to get the necessary dependencies onto their system without extensive backporting: “If someone has done this, or has another simple solution, would you mind writing up some short how-to on the steps you took, please?”\n\nThe Tails team continued to discuss the advantages and disadvantages of removing AdBlock Plus from Tails’ version of Tor Browser.\n\nSadia Afroz compiled a timeline of Tor blocking events, and shared it with the ooni-dev mailing list, along with a request for missing data points; Collin Anderson responded with some additional information.\n\nPatrick Schleizer announced that the Whonix team is looking for “a sponsor who is willing to donate a suitable sized virtual or root server”, and gave a list of planned requirements. If you can meet this need, please see Patrick’s message for next steps.\n\nKonstantin Müller shared a report written as part of a Master’s degree, offering an introduction to “the past, present, and future” of Tor hidden services.\n\nNews from Tor StackExchange\n\nWindy wanted to know how often a client fetches consensus data from a directory server. Jens Kubieziel provided some information by walking through the source code, and concluded: “every minute it is checked if the consensus document is too old. If it is older than the current time a new one will be fetched.”\n\n\n\nThis issue of Tor Weekly News has been assembled by qbi and Harmony.\n\nWant to continue reading TWN? Please help us create this newsletter. We still need more volunteers to watch the Tor community and report important news. Please see the project page , write down your name and subscribe to the team mailing list  if you want to get involved!\n",
            "link": "http://tor.jmtodaro.com//tor-weekly-news-—-february-4th-2015",
            "date": "2015-02-04 01:00:00 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor booth at FOSDEM 2015",
            "content": "The Tor Project and torservers.net will share a booth at FOSDEM’15 in Brussels, Belgium. Meet Tor developers and volunteers running the network!\n",
            "link": "http://tor.jmtodaro.com//events/tor-booth-fosdem-2015",
            "date": "2015-01-28 02:19:41 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor Weekly News — January 28th, 2015",
            "content": "Welcome to the fourth issue in 2015 of Tor Weekly News, the weekly newsletter that covers what’s happening in the Tor community.\n\nThe future of Private Browsing Mode\n\nMozilla Firefox, on which Tor Browser is based, offers users a “Private Browsing Mode” that aims solely to prevent browsing information from being saved locally. As Georg Koppen pointed out, “The question is now how to treat the other privacy-relevant areas like cross-origin linkability or fingerprinting?”\n\nGeorg proposed a “Private Browsing Mode+”, which would integrate the disk-avoidance, anti-tracking, anti-fingerprinting, and location-concealing elements of a privacy-preserving browser in a more logical way.\n\nMiscellaneous news\n\nAfter a “pretty big overhaul”, Damian Johnson announced that Stem, the Tor controller library, now “lazy-loads” descriptors, resulting in a considerable speed increase when reading network documents. “Note that descriptor validation is now opt-in rather than opt-out, so if you’d prefer validation over performance you’ll now need to include ‘validate = True’.”\n\nThe Tails team set out the release schedule for Tails 1.3, and also published its Code of Conduct.\n\nArturo Filastò reported on OONI-related activities at the Nexa Center’s NNTools2015 event.\n\nPatrick Schleizer wondered how Tor Browser could be made to act more like a “system tor”, and sketched out a possible plan: “What do you think about this proposal in general?”\n\n\n\nThis issue of Tor Weekly News has been assembled by Harmony.\n\nWant to continue reading TWN? Please help us create this newsletter. We still need more volunteers to watch the Tor community and report important news. Please see the project page, write down your name and subscribe to the team mailing list if you want to get involved!\n",
            "link": "http://tor.jmtodaro.com//tor-weekly-news-—-january-28th-2015",
            "date": "2015-01-28 01:00:00 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Many Tor people at PETS in Philadelphia",
            "content": "https://petsymposium.org/2015/\n",
            "link": "http://tor.jmtodaro.com//events/many-tor-people-pets-philadelphia",
            "date": "2015-01-27 21:04:20 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor Weekly News — January 21st, 2015",
            "content": "Welcome to the third issue in 2015 of Tor Weekly News, the weekly newsletter that covers what’s happening in the boring Tor community.\n\nTor Browser 4.0.3 and 4.5a3 are out\n\nGeorg Koppen announced two new releases by the Tor Browser team. Version 4.0.3 of the privacy-preserving browser is based on Firefox 31.4.0esr, and also contains updates to NoScript, meek, and Tor Launcher.\n\nThe third release in the 4.5-alpha series allows the secure in-browser update mechanism to handle signed update files, and will reject unsigned ones from now on. It also restores functionality for meek, which was broken in previous 4.5-alpha releases, and offers other improvements and bugfixes — please see Georg’s announcement for the full changelog.\n\nThese releases contain important security updates, so users of both the stable and alpha series should upgrade as soon as possible. Furthermore, Tor Browser 4.5a3 is signed by a new Tor Browser Developers signing key rather than the personal key of an individual developer. If you want to verify your download of the new alpha (and you should!), you will need to retrieve the new key (fingerprint EF6E 286D DA85 EA2A 4BA7 DE68 4E2C 6E87 9329 8290) from a keyserver before doing so.\n\nMiscellaneous news\n\nAnthony G. Basile announced version 20150114 of Tor-ramdisk, the uClibc-based micro Linux distribution whose only purpose is to host a Tor relay in an environment that maximizes security and privacy. This release includes updates to Tor, Libevent, and other key software.\n\nNik announced oppy, an onion proxy implemented in Python: “oppy works like a regular Tor client”, though “there are a number of simplifications made, with the major ones primarily centering around circuit management/build logic and how and when network status documents are collected”. Nik also asked for suggestions on how to take the project forward: “Whether or not I continue hacking on oppy to make it a solid piece of software (rather than just a prototype) or just leave it as is as a reference depends on whether or not the Tor development community sees any real uses or future potential for the project”.\n\nmeejah announced a new one-to-one encrypted and anonymous voice chat feature for “carml”, the command-line Tor control utility: “ [It] essentially cross-connects the mic + speakers of each side via an Opus + OGG stream over a single Tor TCP connection.” As meejah warns, it is “NOT FOR REAL USE at all yet”, but if you have experience with gstreamer and/or OGG then please see meejah’s message for some unresolved questions.\n\nFollowing suggestions from Sebastian Urbach and grarpamp, Karsten Loesing altered the main unit of data rate measurement for the Tor Metrics portal from MiB/s (mebibytes per second) to the more common Gbit/s (gigabits per second).\n\nPhilipp Winter published preliminary statistics and analysis obtained by running a Go implementation of Doctor’s sybil-hunting script over archived consensuses: “I’ll have a more detailed analysis at some point in the future.”\n\nThe Tails team published instructions for running an nginx webserver as a hidden service using a copy of Tails: “Feedback is welcome!”\n\nThanks to Frédéric Cornu for running a mirror of the Tor Project’s website and software!\n\nThis week in Tor history\n\nA year ago this week, the “Spoiled Onions” project published its preliminary technical report. The goal of the project was to monitor Tor exit relays in order to “expose, document, and thwart malicious or misconfigured relays”; the researchers turned up 65 such relays over the course of their investigation, with the culprits engaging in attacks such as “SSH and HTTPS MitM, HTML injection, SSL stripping, and traffic sniffing”, or unintentionally interfering with traffic as a result of upstream censorship.\n\nEvents such as the RELAY_EARLY traffic confirmation attack and the sybil attacks late last year have only highlighted the importance of monitoring for malicious relays in the Tor network. The bad-relays mailing list serves as a reporting channel for Tor community members who believe particular relays are up to no good (messages sent to the list are not publicly visible, for various reasons); David Fifield has been experimenting with data visualizations of significant network events; and Philipp Winter, a “Spoiled Onions” co-author, has been working on additional tools (such as the above-mentioned Go sybil hunter and “zoossh”, a speedy Tor network document parser) to make these checks more efficient — to give only a few examples of recent work by the community on this issue.\n\n\n\nThis issue of Tor Weekly News has been assembled by Harmony.\n\nWant to continue reading TWN? Please help us create this newsletter. We still need more volunteers to watch the Tor community and report important news. Please see the project page, write down your name and subscribe to the team mailing list if you want to get involved!\n",
            "link": "http://tor.jmtodaro.com//tor-weekly-news-—-january-21st-2015",
            "date": "2015-01-21 01:00:00 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor Browser 4.5a3 is released",
            "content": "The third alpha release of the 4.5 series is available from the extended downloads page and also from our distribution directory.\n\nNote: The individual bundles of the alpha series are signed by one of the subkeys of the Tor Browser Developers signing key from now on. You can find its fingerprint on the Signing Keys page. It is:\n\n pub   4096R/0x4E2C6E8793298290 2014-12-15       Key fingerprint = EF6E 286D DA85 EA2A 4BA7                         DE68 4E2C 6E87 9329 8290 \n\n\nTor Browser 4.5a3 is based on Firefox ESR 31.4.0, which features important security updates to Firefox. Its updater now contains the code for verifying signed update files and does not accept unsigned ones anymore. Moreover, this release includes an updated Tor, 0.2.6.2-alpha, an updated meek, 0.15, which is now working again, and a bunch of additional improvements and bugfixes.\n\nHere is the changelog since 4.5-alpha-2:\n\n\n  All Platforms\n\n\n  Update Firefox to 31.4.0esr\n  Update Tor to 0.2.6.2-alpha\n  Update NoScript to 2.6.9.10\n  Update HTTPS Everywhere to 5.0developement.2\n  Update meek to 0.15\n  Update Torbutton to 1.8.1.3\n\n\n  Bug 13998: Handle changes in NoScript 2.6.9.8+\n  Bug 14100: Option to hide NetworkSettings menuitem\n  Bug 13079: Option to skip control port verification\n  Bug 13835: Option to change default Tor Browser homepage\n  Bug 11449: Fix new identity error if NoScript is not enabled\n  Bug 13881: Localize strings for tor circuit display\n  Bug 9387: Incorporate user feedback\n  Bug 13671: Fixup for circuit display if bridges are used\n  Translation updates\n\n  Update Tor Launcher 0.2.7.1\n\n\n  Bug 14122: Hide logo if TOR_HIDE_BROWSER_LOGO set\n  Translation updates\n\n  Bug 13379: Sign our MAR files\n  Bug 13788: Fix broken meek in 4.5-alpha series\n  Bug 13439: No canvas prompt for content callers\n\n\n",
            "link": "http://tor.jmtodaro.com//tor-browser-45a3-released",
            "date": "2015-01-16 04:37:44 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor Weekly News — January 14th, 2015",
            "content": "Welcome to the second issue in 2015 of Tor Weekly News, the weekly newsletter that covers what’s happening in the Tor community.\n\nWhat to do if meek gets blocked\n\nRegular readers of Tor Weekly News will be familiar with meek, the pluggable transport developed by David Fifield. Where most existing transports work by connecting clients to “bridge” relays that are difficult for the adversary to discover (or identify as relays), meek makes all of a client’s Tor traffic appear as though it is destined for a domain that is “too big to block” — in other words, web platforms so popular that a censor cannot prevent access to them without disrupting lots of unrelated Internet activity in its sphere of control — when in fact the traffic is sent to meek servers running on those platforms, which in turn relay it into the regular Tor network. Google, Amazon, and Microsoft are some of the services whose domain names currently work as disguises for meek.\n\nUnfortunately, that doesn’t mean meek is unblockable. As David wrote to the tor-talk mailing list, “that’s the wrong way to think about the problem”. “It is designed to be difficult and expensive to block […] but suppose a censor makes that call, and blocks Google/Amazon/whatever. What then?”\n\nTwo easy solutions are selecting a different backend (meek-amazon instead of meek-google, for example) or using a different DNS server: “The most common way to block a domain name is by DNS poisoning; i.e., the IP address behind the name is accessible, but the local DNS server gives you a false address. Try a public DNS server such as 8.8.8.8. But if that works, be aware that it’s probably only a temporary fix, as censors have historically figured out the alternate-DNS trick pretty fast.”\n\n“What you really want to do”, David suggested, “if the easy things don’t work, is choose a different front domain.” Please see David’s message for a fuller explanation of the difference between the backend and the “front domain”, and a guide to configuring new domains — as well as one to setting up your own meek web app, if all else fails.\n\nMiscellaneous news\n\nsycamoreone announced orc, a Go library that implements parts of Tor’s control protocol. “I do have some ideas for a higher-level interface, but no fixed plan yet. The next step will probably be to add net/http-like handlerFuncs to handle (asynchronous) replies from the onion router.”\n\ntaxakis linked to “Post-Quantum Secure Onion Routing” by Satrajit Ghosh and Aniket Kate, a new paper proposing a successor to the currently-used ntor handshake protocol that would be “resilient against quantum attacks, but also at the same time allow OR nodes to use the current DH public keys, and consequently require no modification to the current Tor public key infrastructure.” Nick Mathewson wondered whether “anybody around here has the cryptographic background to comment on the PQ part of their scheme?”, and compared it to Yawning Angel’s experimental “basket” protocol.\n\nNick also sent out a draft of proposal 240, describing “a simple way for directory authorities to perform signing key revocation”.\n\nDaniel Forster asked for advice on proposed research into splitting traffic over multiple entry guards in combination with traffic padding: “Is the approach heading in a not so great direction w.r.t. the Tor Project’s ‘only one entry node’ decision?”\n\nKarsten Loesing submitted his status report for December, and George Kadianakis sent out the report for SponsorR.\n\n“After CCC I have a list of people that I have given raspberry pi’s with ooniprobe, and I would like to start coordinating with them via a mailing list”, wrote Arturo Filastò, and the result is the ooni-operators mailing list. If you regularly run ooniprobe, or want to start, be sure to sign up!\n\nAleksejs Popovs shared with the ooni-dev mailing list the results of an OONI investigation into Latvian internet censorship, conducted using ooniprobe.\n\nDan O’Huiginn started a conversation about how to ensure users are informed of the possible consequences of running OONI tests.\n\nThanks to John Knoll and Monsieur Tino for running mirrors of the Tor Project’s website and software archive!\n\n“How do we prevent a website mirror admin from tampering with the served files?”, wondered Frédéric Cornu. Christian Krbusek clarified that “in fact, you can’t prevent that, but you are also mirroring the signature files. So anybody downloading from any mirror — even the original host — should verify the downloads”. Andrew Lewman added that “the binaries are signed by well-known keys of tor packagers and developers. The mirror update script randomly selects a binary and verifies it each time it runs. If the binaries don&#39;t match, the mirror is removed from the public list.”\n\n\n\nThis issue of Tor Weekly News has been assembled by Harmony.\n\nWant to continue reading TWN? Please help us create this newsletter. We still need more volunteers to watch the Tor community and report important news. Please see the project page, write down your name and subscribe to the team mailing list if you want to get involved!\n",
            "link": "http://tor.jmtodaro.com//tor-weekly-news-—-january-14th-2015",
            "date": "2015-01-14 01:00:00 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor Browser 4.0.3 is released",
            "content": "A new release for the stable Tor Browser is available from the Tor Browser Project page and also from our distribution directory.\n\nTor Browser 4.0.3 is based on Firefox ESR 31.4.0, which features important security updates to Firefox. Additionally, it contains updates to meek, NoScript and Tor Launcher.\n\nHere is the changelog since 4.0.2:\n\n\n  All Platforms\n\n\n  Update Firefox to 31.4.0esr\n  Update NoScript to 2.6.9.10\n  Update meek to 0.15\n  Update Tor Launcher to 0.2.7.0.2\n\n\n  Translation updates only\n\n\n\n",
            "link": "http://tor.jmtodaro.com//tor-browser-403-released",
            "date": "2015-01-13 06:43:49 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Jacob talking about Tor in Tokyo, Japan at FSIJ meeting",
            "content": "Jacob is giving a talk about Tor and OTR hosted by the Free Software Initiative of Japan.\n",
            "link": "http://tor.jmtodaro.com//events/jacob-talking-about-tor-tokyo-japan-fsij-meeting",
            "date": "2015-01-10 01:40:46 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor Weekly News — January 7th, 2015",
            "content": "Welcome to the first issue in 2015 of Tor Weekly News, the weekly newsletter that covers what’s happening in the Tor community.\n\nTor 0.2.6.2-alpha is out\n\nNick Mathewson announced the second alpha release in the Tor 0.2.6.x series. As well as including the cell scheduling changes and hidden service statistics collection reported in recent issues of TWN, this release makes it harder to portscan hidden services by closing circuits if a client tries to connect to a non-existent port. It also contains numerous bugfixes and new unit tests; please see Nick’s announcement for the full changelog. The source code is available as usual from the distribution directory.\n\nTor at 31c3\n\nThe 31st edition of the Chaos Communication Congress, an annual highlight in the free software and security calendar, took place in Hamburg, and as usual Tor featured in several key talks over the course of the long weekend.\n\nRoger Dingledine and Jacob Appelbaum’s appropriately grand-sounding “State of the Onion” address, a round-up of the year’s events in the Tor community, took place once again, with guest contributions from journalist and filmmaker Laura Poitras and OONI developer Arturo Filastò. Topics included the relationship between censorship and surveillance, the misinterpretation of academic research by journalists, new pluggable transports, and much more.\n\nLaura Poitras also joined Julia Angwin, Jack Gillum, and Nadia Heninger for “Crypto Tales from the Trenches”, in which the journalists described their experiences with security software when doing research and communicating with sources. “I don’t think any of us could do our work without Tor”, said Laura, while Julia described the Tails operating system as “her favorite success story” in this field.\n\nTor Browser developer Mike Perry joined Seth Schoen to discuss the concept of deterministic builds, the implementation of which has been one of the Tor Project’s major successes over the past year. Mike and Seth demonstrated some of the attacks that this system aims to defend against, as well as the work that Tor, F-Droid, and Debian have all been doing to make their processes compatible with the deterministic build process.\n\nFinally, Dr. Gareth Owen of Portsmouth University presented the results of research into the content and usage of Tor hidden services. The research involved setting up a number of Tor relays, waiting until they gained the “HSDir” flag, then counting the number of times a particular service’s descriptor was requested, as well as manually categorizing the services whose descriptors were learned. Dr. Owen found that while the largest category of onion services by number could be characterized as “drugs”, the majority of the descriptor requests he saw were for services in his “abuse” category. The talk itself discusses some possible limitations of the data gathered, and Tor developers have responded on the Tor blog with further analysis.\n\nMonthly status reports for December 2014\n\nThe wave of regular monthly reports from Tor project members for the month of December has begun. Philipp Winter released his report first, followed by reports from Damian Johnson, Pearl Crescent, Juha Nurmi, Nick Mathewson, Sherief Alaa, Sukhbir Singh, Leiah Jansen, David Goulet, Michael Schloh von Bennewitz, Colin C., Georg Koppen, Arlo Breault, and George Kadianakis.\n\nColin C. also sent out the help desk report, while Arturo Filastò reported on behalf of the OONI team and Mike Perry for the Tor Browser team.\n\nMiscellaneous news\n\nNick Mathewson and Andrea Shepard drafted a proposal for including a hash chain in the consensus produced by Tor directory authorities, in order to prevent certain kinds of attack on the directory authorities and their keys.\n\nNick also clarified that a recently-discovered Libevent vulnerability has no effect on Tor.\n\nIn connection with the current push to collect statistics relating to Tor hidden services in a privacy-preserving manner, Aaron Johnson noted that there are two further desirable sets of statistics which might pose a risk to anonymity if gathered incorrectly, and discussed possible solutions to the problem.\n\nDavid Fifield published a summary of costs incurred by the meek pluggable transport for the month of December 2014.\n\nDavid also continued his experiments on historical Tor metrics data with visualizations of a recent Sybil attack, and wondered what might have been responsible for a sudden change in the way that users in Kazakhstan were choosing to connect to the Tor network in October 2014.\n\nSebastian Urbach noted a sudden drop in the number of Tor relays acting as hidden service directories, and wondered about the cause. As SiNA Rabbani clarified, the amount of time a relay needs to have been running before it earns the “HSDir” flag was increased by directory authorities, in response to a recent Sybil attack.\n\nThe developers of ChatSecure for iOS announced that their recent 3.0 release includes experimental support for connections to XMPP chat servers over Tor, and briefly described how they added the new feature.\n\n\n\nThis issue of Tor Weekly News has been assembled by Harmony, David Fifield, Catfish, and Karsten Loesing.\n\nWant to continue reading TWN? Please help us create this newsletter. We still need more volunteers to watch the Tor community and report important news. Please see the project page, write down your name and subscribe to the team mailing list if you want to get involved!\n",
            "link": "http://tor.jmtodaro.com//tor-weekly-news-—-january-7th-2015",
            "date": "2015-01-07 01:00:00 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor 0.2.6.2-alpha is released",
            "content": "Tor 0.2.6.2-alpha is the second alpha release in the 0.2.6.x series. It introduces a major new backend for deciding when to send cells on channels, which should lead down the road to big performance increases. It contains security and statistics features for better work on hidden services, and numerous bugfixes.\n\nThis release contains many new unit tests, along with major performance improvements for running testing networks using Chutney. Thanks to a series of patches contributed by &quot;teor&quot;, testing networks should now bootstrap in seconds, rather than minutes.\n\nYou can download the source from the usual place on the website. Packages should be up in a few days.\n\nNOTE: This is an alpha release. Please expect bugs.\n\nChanges in version 0.2.6.2-alpha - 2014-12-31\n\n\nMajor features (relay, infrastructure):\n\n\nComplete revision of the code that relays use to decide which cell to send next. Formerly, we selected the best circuit to write on each channel, but we didn&#39;t select among channels in any sophisticated way. Now, we choose the best circuits globally from among those whose channels are ready to deliver traffic.\n\nThis patch implements a new inter-cmux comparison API, a global high/low watermark mechanism and a global scheduler loop for transmission prioritization across all channels as well as among circuits on one channel. This schedule is currently tuned to (tolerantly) avoid making changes in network performance, but it should form the basis for major circuit performance increases in the future. Code by Andrea; tuning by Rob Jansen; implements ticket 9262.\n\nMajor features (hidden services):\n\n\n  Make HS port scanning more difficult by immediately closing the circuit when a user attempts to connect to a nonexistent port. Closes ticket 13667.\n  Add a HiddenServiceStatistics option that allows Tor relays to gather and publish statistics about the overall size and volume of hidden service usage. Specifically, when this option is turned on, an HSDir will publish an approximate number of hidden services that have published descriptors to it the past 24 hours. Also, if a relay has acted as a hidden service rendezvous point, it will publish the approximate amount of rendezvous cells it has relayed the past 24 hours. The statistics themselves are obfuscated so that the exact values cannot be derived. For more details see proposal 238, &quot;Better hidden service stats from Tor relays&quot;. This feature is currently disabled by default. Implements feature 13192.\n\n\n\n  read more »\n",
            "link": "http://tor.jmtodaro.com//tor-0262-alpha-released",
            "date": "2014-12-31 07:28:53 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor Weekly News — December 31st, 2014",
            "content": "Welcome to the final issue in 2014 of Tor Weekly News, the weekly newsletter that covers what’s happening in the Tor community.\n\nAttacks and rumors of attacks\n\nTwo weeks ago, the Tor Project relayed a warning from an unspecified source to the effect that someone may have been preparing to seize, attack, or otherwise disable one or more of Tor’s directory authorities in a bid to disrupt the entire Tor network. The lack of any specific information about the threat caused understandable concern in the Tor community, and several events that followed over the next fortnight did little to dispel this.\n\nFirst, the operator of a large Tor exit relay cluster reported that his servers may have been physically interfered with by unknown parties a short while before his message. Later updates suggested that foul play was less likely than initially thought.\n\nSeveral days later, a large number of small exit relays were created all at once, in what appeared to be a “Sybil attack”; this was detected and halted almost immediately, as was a second, more recent incident. As the Tor Project put it in a response, “we don’t expect any anonymity or performance effects based on what we&#39;ve seen so far”, although a side-effect of the countermeasure is that relays hosted on some IP ranges are currently being rejected by dirauths.\n\nAs far as anyone can tell, these events are not related in any way to the initial warning. The Tor network has functioned normally throughout this period, and the appearance of a series of incidents is likely to be the result of coincidence (helped by the online rumor mill) rather than a coordinated campaign. It is never possible to say with certainty that attacks on the network will not occur, but the threat referred to in the original blog post has not yet materialized — and “no news is good news”.\n\nMiscellaneous news\n\nLasse Øverlier discovered that ScrambleSuit’s protection against “replay attacks”, in which an adversary repeats a client authentication event to learn that the server is in fact a ScrambleSuit bridge, doesn’t work. Philipp Winter explained the issue, and suggested some simple fixes.\n\nTom van der Woerdt asked for review of a patch to remove the obsolete version 1 of Tor’s link protocol from the current software: “It’s a rather large patch, though not as large as the patch that will remove v2 of the protocol. However, before I write that one, can someone please check whether my patch is sane and I’m not violating any standards or policies?”\n\nDavid Fifield trimmed the length of meek’s HTTP headers from 413 to 162 bytes, reducing the bandwidth it uses by “approximately” 3%.\n\nThanks to Kura for running a mirror of the Tor Project website and software archive!\n\n\n\nThis issue of Tor Weekly News has been assembled by Harmony, David Fifield, Chuck Peters, and Roger Dingledine.\n\nWant to continue reading TWN? Please help us create this newsletter. We still need more volunteers to watch the Tor community and report important news. Please see the project page, write down your name and subscribe to the team mailing list if you want to get involved!\n",
            "link": "http://tor.jmtodaro.com//tor-weekly-news-—-december-31st-2014",
            "date": "2014-12-31 01:00:00 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "The Tor talk at 31c3",
            "content": "And on a more cheerful note, I heard that Jake and Roger gave a really excellent talk about Tor at this year&#39;s CCC. And the CCC people have thoughtfully put it online! If you didn&#39;t see it, you might want to check it out. The talking begins at around 15:16, and the introduction is well worth watching too.\n\nI&#39;m also going to spend a while looking at the other presentations too. Right now the one at the top of the page is an ECC talk by Daniel Bernstein and Tanja Lange; I&#39;m looking forward to having a little time to watch it, and a bunch of others I see there.\n\nHappy new year, everyone!\n\nupdate (1/1/15): &quot;State of the Onion&quot; is available for download now. You can find torrent and direct links in various formats on C3TV website.\n\nVideo: MP4 HD (torrent) - WEBM (torrent) - MP4 (torrent)\n Audio: MP3 (torrent) - OPUS (torrent)\n",
            "link": "http://tor.jmtodaro.com//tor-talk-31c3",
            "date": "2014-12-30 16:00:39 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Some thoughts on Hidden Services",
            "content": "Hi! Nick here.\n\nI ought to post my own responses to that Andy Greenberg article, too. (Especially since most everybody else around here is at 31c3 right now, or sick with the flu, or both.)\n\nWhen I saw the coverage of the hidden services study that was presented at CCC today, I was reminded of the media fallout from that old study from the 1990s that &quot;proved&quot; that a ridiculously high fraction of the internet was pornography...by looking at Usenet*, and by counting newsgroups and bytes. (You might remember it; it was the basis of the delightful TIME Magazine &quot;Cyberporn&quot; cover.)\n\nThe 1990s researcher wasn&#39;t lying outright, but he and the press *were* conflating one question: &quot;What fraction of Usenet groups are &#39;alt.sex&#39; or &#39;alt.binaries&#39; (file posting) groups&quot; with two others: &quot;What fraction of internet traffic is porn?&quot; and &quot;What fraction of internet-user hours are spent on porn?&quot;\n\nThese are quite different things.\n\nThe presentation today focused on data about hidden service types and usage. Predictably, given the results from Biryukov, Pustogarov, Thill, and Weinmann, the researcher found that hidden services related to child abuse are only a small fraction of the total number of hidden service addresses on the network. And because of the way that hidden services work, traffic does not go through hidden service directories, but instead through rendezvous points (randomly chosen Tor nodes): so no relay that knows the hidden service&#39;s address will learn the actual amount of traffic transmitted. But, as previously documented, abusive services represent a disproportionate fraction of usage... if you&#39;re measuring usage with hidden service directory requests.\n\nWhy might that be?\n\nFirst, some background. Basically, a Tor client makes a hidden service directory request the first time it visits a hidden service that it has not been to in a while. (If you spend hours at one hidden service, you make about 1 hidden service directory request. But if you spend 1 second each at 100 hidden services, you make about 100 requests.) Therefore, obsessive users who visit many sites in a session account for many more of the requests that this study measures than users who visit a smaller number of sites with equal frequency.\n\nThere are other confounding factors as well. Due to bugs in older Tor implementations, a hidden service that is unreliable (or completely unavailable) will get many, many more hidden service directory requests than a reliable one. So if any abuse sites are unusually unreliable, we&#39;d expect their users to create a disproportionately large number of hidden service directory requests.\n\nAlso, a very large number of hidden service directory requests are probably not made by humans! See bug 13287: We don&#39;t know what&#39;s up with that. Could this be caused by some kind of anti-abuse organization running an automated scanning tool?\n\nIn any case, a methodology that looks primarily at hidden service directory requests will over-rate services that are frequently accessed from a Tor client that hasn&#39;t been there recently, and under-rate services that are used via tor2web, and so on. It also depends a lot on how hidden services are configured, how frequently Tor hidden service directories go up and down, and what times of day they change introduction points in comparison to what time of day their users tend to be awake.\n\nThe greater the number of distinct hidden services a person visits, and the less reliable those sites are, the more hidden service directory requests they will trigger.\n\nSuppose 10 people use hidden services to look at conspiracy theories, 100 people use hidden services to buy Cuban cigars, and 1000 people use it for online chat.\n\nBut suppose that the average cigar purchaser visits only one or two sites to make purchases, and the average chat user joins one or two networks, whereas the average conspiracy theorist needs to visit several dozen forums and wikis.\n\nSuppose also that the average Cuban cigar purchaser makes about two purchases a month, the average chat user logs in once a day, and the average conspiracy theorist spends 3 hours a day crawling the hidden web.\n\nAnd suppose that conspiracy theory websites come and go frequently, whereas cigar sites and chat networks are more stable.\n\nIn this analysis, even though there are far more people buying cigars, users who use it for obsessive behavior that spans multiple unreliable hidden services will be far overrepresented in the count of hidden service directory requests than users who use it for activities done less frequently and across fewer services. So any comparison of hidden service directory request counts will say more about the behavioral differences of different types of users than about their relative numbers, or the amount of traffic they generated.\n\nIn conclusion, let&#39;s spend a minute talking about freedom and philosophy. Any system that provides security on the Internet will inevitably see some use by bad people that we&#39;d rather not help at all. After all, cars are used for getaways, and window shades conceal all kinds of criminality. The only way to make a privacy tool that nobody abuses is to make it so weak that people aren&#39;t willing to touch it, or so unusable that nobody can figure it out.\n\nUp till now, many of the early adopters for Tor hidden services have been folks for whom the risk/effort calculations have been quite extreme, since--as I&#39;d certainly acknowledge--the system isn&#39;t terribly usable for the average person as it stands. Roger noted earlier that hidden services amount to less than 2% of our total traffic today. Given their privacy potential, I think that&#39;s not even close to enough. We&#39;ve got to work over the next year or more to develop hidden services to the point where their positive impact is felt by the average netizen, whether they&#39;re publishing a personal blog for their friends, using a novel communications protocol more secure than email, or reading a news article based on information that a journalist received through an anonymous submission system. Otherwise, they&#39;ll remain a target for every kind of speculation, and every misunderstanding about them will lead people to conclude the worst about privacy online. Come lend a hand?\n\n(Also, no offense to Andy on this: he is a fine tech reporter and apparently a fine person. And no offense to Dr. Owen, who explained his results a lot more carefully than they have been re-explained elsewhere. Now please forgive me, I&#39;m off to write some more software and get some sleep. Please direct all media inquiries to the email of &quot;press at torproject dot org&quot;.)\n\n* Usenet was sort of like Twitter, only you could write paragraphs on it. ;)\n",
            "link": "http://tor.jmtodaro.com//some-thoughts-hidden-services",
            "date": "2014-12-30 15:05:35 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor: 80 percent of ??? percent of 1-2 percent abusive.",
            "content": "Hi, Nick here.\n\nRoger&#39;s at 31c3, so I&#39;ll post his statement about that article you might have seen:\n\n\nTor hidden service traffic, which Dr. Gareth Owen discussed in his talk this afternooon, is only 1.5% of all Tor traffic. Tor gets about 2 million users per day total.\n The researcher ran a set of Tor relays for a six month period, and recorded how many times somebody attempted to look up a hidden service (this lookup is one of the steps in visiting a hidden service). Then at the end of that period, he scanned the hidden services he&#39;d learned about, to find out what sort of content was on them.\n\nDr. Owen&#39;s data shows that there&#39;s a lot of churn in hidden services, so nearly all of the sites were gone by the time he did these scans. His graphs only show data about the sites that were still up many months later: so his data could either show a lot of people visiting abuse-related hidden services, or it could simply show that abuse-related hidden services are more long-lived than others. We can&#39;t tell from the data.\n\nWithout knowing how many sites disappeared before he got around to looking at them, it&#39;s impossible to know what percentage of fetches went to abuse sites.\n\nThere are important uses for hidden services, such as when human rights activists use them to access Facebook or to blog anonymously. These uses for hidden services are new and have great potential.\n\nPS: Law enforcement agencies use Tor to stay anonymous while they catch bad guys. Law enforcement agencies use and run hidden services, too.\n\n\nMore info to follow.\n",
            "link": "http://tor.jmtodaro.com//tor-80-percent-percent-1-2-percent-abusive",
            "date": "2014-12-30 08:07:42 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor Weekly News — December 24th, 2014",
            "content": "Welcome to the fifty-first issue in 2014 of Tor Weekly News, the weekly newsletter that covers what’s happening in the Tor community.\n\nStem 1.3 is out\n\n“After months down in the engine room”, Damian Johnson announced version 1.3 of Stem, the Tor controller library written in Python. Among the many improvements in this release, Damian singled out the new set of controller methods for working with hidden services, as well as the 40% increase in descriptor parsing speed.\n\nPlease see the changelog for full details of all the new features.\n\nMiscellaneous news\n\nThe team of researchers working on the collection of hidden service statistics asked relay operators for help by enabling these statistics on their relays in the coming days and weeks. They included a step-by-step tutorial for enabling this feature, which has recently been merged into Tor’s main branch.\n\nBuilding on Andrea Shepard’s recently-merged work on global cell scheduling, Nick Mathewson announced that the KIST socket management algorithm proposed earlier this year to reduce congestion in the Tor network is now “somewhat implemented” for Linux. You can follow the testing and reviews on the associated ticket.\n\nNick also asked for feedback on the proposal to increase the interval at which Tor relays report their bandwidth usage statistics from fifteen minutes to four hours : “Will this break anything you know about?”\n\nMoritz Bartl invited Tor relay operators to a meet-up at the upcoming Chaos Communication Congress in Hamburg: “We will do quick presentations on recent and future activities around Torservers.net, talk about events relevant to the Tor relay community, and what lies ahead.”\n\nThanks to Thomas White for keeping the community updated following a brief period of suspicious activity around his exit relays and Onionoo application mirrors!\n\nThis week in Tor history\n\nA year ago this week, Tor Browser hit version 3.5, bringing with it a pioneering deterministic build system that set a new standard in software distribution security, and has since drawn interest from many other projects, including the Debian operating system. It also laid the long-obsolete Vidalia graphical controller to rest, replacing it with the faster, sleeker Tor Launcher. The privacy-preserving browser is now approaching version 4.5, and users can look forward to a security slider offering finer-grained tuning of security preferences, as well as features that restore some of Vidalia’s circuit-visualization capabilities.\n\n\n\nThis issue of Tor Weekly News has been assembled by Harmony and Karsten Loesing.\n\nWant to continue reading TWN? Please help us create this newsletter. We still need more volunteers to watch the Tor community and report important news. Please see the project page, write down your name and subscribe to the team mailing list if you want to get involved!\n",
            "link": "http://tor.jmtodaro.com//tor-weekly-news-—-december-24th-2014",
            "date": "2014-12-24 01:00:00 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Stem Release 1.3",
            "content": "Greetings wonderful people of the world! After months down in the engine room I&#39;m delighted to announce the 1.3.0 release of Stem.\n\nFor those who aren&#39;t familiar with it, Stem is a Python library for interacting with Tor. With it you can script against your relay, descriptor data, or even write applications similar to arm and Vidalia.\n\nhttps://stem.torproject.org/\n\nSo what&#39;s new in this release?\n\n\n\nBetter Hidden Service Support\n\nNow it&#39;s easier than ever to spin up hidden services!\n\nThanks to contributions from Federico Ceratto and Patrick O&#39;Doherty we now have a set of methods specifically for working with hidden services. Check it out in our new tutorial...\n\nOver the River and Through the Wood\n\n\n\nFaster Descriptor Parsing\n\nThis release dramatically improves the speed at which Stem can parse decriptors. Thanks to optimizations from Nick Mathewson and Ossi Herrala we can now read descriptors 40% faster!\n\n\n\nThis is just the tip of the iceberg. For a full rundown on the myriad of improvements and fixes in this release see...\n\nhttps://stem.torproject.org/change_log.html#version-1-3\n\nCheers! -Damian\n",
            "link": "http://tor.jmtodaro.com//stem-release-13",
            "date": "2014-12-22 11:12:55 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Possible upcoming attempts to disable the Tor network",
            "content": "The Tor Project has learned that there may be an attempt to incapacitate our network in the next few days through the seizure of specialized servers in the network called directory authorities. (Directory authorities help Tor clients learn the list of relays that make up the Tor network.) We are taking steps now to ensure the safety of our users, and our system is already built to be redundant so that users maintain anonymity even if the network is attacked. Tor remains safe to use.\n\nWe hope that this attack doesn&#39;t occur; Tor is used by many good people. If the network is affected, we will immediately inform users via this blog and our Twitter feed @TorProject, along with more information if we become aware of any related risks to Tor users.\n\nThe Tor network provides a safe haven from surveillance, censorship, and computer network exploitation for millions of people who live in repressive regimes, including human rights activists in countries such as Iran, Syria, and Russia. People use the Tor network every day to conduct their daily business without fear that their online activities and speech (Facebook posts, email, Twitter feeds) will be tracked and used against them later. Millions more also use the Tor network at their local internet cafe to stay safe for ordinary web browsing.\n\nTor is also used by banks, diplomatic officials, members of law enforcement, bloggers, and many others. Attempts to disable the Tor network would interfere with all of these users, not just ones disliked by the attacker.\n\nEvery person has the right to privacy. This right is a foundation of a democratic society. For example, if Members of the British Parliament or US Congress cannot share ideas and opinions free of government spying, then they cannot remain independent from other branches of government. If journalists are unable to keep their sources confidential, then the ability of the press to check the power of the government is compromised. If human rights workers can&#39;t report evidence of possible crimes against humanity, it is impossible for other bodies to examine this evidence and to react. In the service of justice, we believe that the answer is to open up communication lines for everyone, securely and anonymously.\n\nThe Tor network provides online anonymity and privacy that allow freedom for everyone. Like freedom of speech, online privacy is a right for all.\n\n[Update Monday Dec 22: So far all is quiet on the directory authority front, and no news is good news.]\n [Update Sunday Dec 28: Still quiet. This is good.]\n",
            "link": "http://tor.jmtodaro.com//possible-upcoming-attempts-disable-tor-network",
            "date": "2014-12-19 10:09:10 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor Weekly News — December 17th, 2014",
            "content": "Welcome to the fiftieth issue in 2014 of Tor Weekly News, the weekly newsletter that covers what’s happening in the Tor community.\n\nSolidarity against online harassment\n\nFollowing “a sustained campaign of harassment” directed at a core Tor developer over the past few months, the Tor Project published a statement in which it declared “support for her, for every member of our organization, and for every member of our community who experiences this harassment”: “In categorically condemning the urge to harass, we mean categorically: we will neither tolerate it in others, nor will we accept it among ourselves. We are dedicated to both protecting our employees and colleagues from violence, and trying to foster more positive and mindful behavior online ourselves… We are working within our community to devise ways to concretely support people who suffer from online harassment; this statement is part of that discussion. We hope it will contribute to the larger public conversation about online harassment and we encourage other organizations to sign on to it or write one of their own.”\n\nAs of this writing, there are 448 signatories to the statement, including Tor developers and community members, academics, journalists, lawyers, and many others who are lending their support to this movement in its early stages. If you want to add your name to the list, please send an email to tor-assistants@lists.torproject.org.\n\nTails 1.2.2 is out\n\nThe Tails team announced a pointfix release of the amnesic live operating system. The only difference between this version and the recent 1.2.1 release is that the automatic Tails Updater now expects a different certificate authority when checking for a new Tails version. As the team explained, “On January 3rd, the SSL certificate of our website hosting provider, boum.org, will expire. The new certificate will be issued by a different certificate authority […] As a consequence, versions previous to 1.2.2 won’t be able to do the next automatic upgrade to version 1.2.3 and will receive an error message from Tails Upgrader when starting Tails after January 3rd”.\n\nThis, along with a bug that prevents automatic updates from 1.2.1 to 1.2.2, means that all Tails users will need to upgrade manually: either to version 1.2.2 before January 3rd or (if for some reason that is not possible) to version 1.2.3 following its release on January 14th. Please see the team’s post for more details and download instructions.\n\nMiscellaneous news\n\nGeorge Kadianakis, Karsten Loesing, Aaron Johnson, and David Goulet requested feedback on the design and code they have developed for the Tor branch that will enable the collection of statistics on Tor hidden services, hoping to answer the questions “Approximately how many hidden services are there?” and “Approximately how much traffic in the Tor network is going to hidden services?”: “Our plan is that in approximately a week we will ask volunteers to run the branch. Then in a month from now we will use those stats to write a blog post about the approximate size of Tor hidden services network and the approximate traffic it’s pushing.” Please join in with your comments on the relevant ticket!\n\nPhilipp Winter announced an early version of “zoossh”, which as the name implies is a speedy parser written in Go that will help to “detect sybils and other anomalies in the Tor network” by examining Tor’s archive of network data. While it is not quite ready for use, “I wanted folks to know that I’m working on that and I’m always happy to get feedback and patches.”\n\nYawning Angel announced the existence of “basket”, a “stab at designing something that significantly increases Tor’s resistance to upcoming/future attacks”, combining post-quantum cryptographic primitives with “defenses against website fingerprinting (and possibly end-to-end correlation) attacks”. You can read full details of the cryptographic and other features of “basket” in Yawning’s post, which is replete with warnings against using the software at this stage: “It’s almost at the point where brave members of the general public should be aware that it exists as a potential option in the privacy toolbox… [but] seriously, unless you are a developer or researcher, you REALLY SHOULD NOT use ‘basket’.” If you are gifted or foolhardy enough to ignore Yawning’s advice and test “basket” for yourself, please let the tor-dev mailing list know what you find.\n\nSukhbir Singh and Arlo Breault requested feedback on an alpha version of Tor Messenger. It is an instant messaging client currently under development that intends to send all traffic over Tor, use Off-the-Record (OTR) encryption of conversations by default, work with a wide variety of chat networks, and have an easy-to-use graphical user interface localized into multiple languages.\n\nTheCthulhu announced that his mirrors of two Tor network tools are now available over Tor hidden services. Globe can be accessed via http://globe223ezvh6bps.onion and Atlas via http://atlas777hhh7mcs7.onion. The mirrors provided by the Cthulhu run on their own instance of Onionoo, so in the event that the primary sites hosted by Tor Project are offline, both of these new mirrors should still be available for use either through the new hidden services or through regular clearnet access.\n\nThe Tails team published a signed list of SHA256 hashes for every version of Tails (and its predecessor, amnesia) that it had either built or verified at the time of release.\n\nVlad Tsyrklevich raised the issue of the discoverability risk posed to Tor bridges by the default setting of their ORPorts to 443 or 9001. Using data from Onionoo and internet-wide scans, Vlad found that “there are 4267 bridges, of which 1819 serve their ORPort on port 443 and 383 serve on port 9001. That’s 52% of tor bridges. There are 1926 pluggable-transports enabled bridges, 316 with ORPort 443 and 33 with ORPort 9001. That’s 18% of Tor bridges… I realized I was also discovering a fair amount of private bridges not included in the Onionoo data set.” Vlad recommended that operators be warned to change their ORPorts away from the default; Aaron Johnson suggested possible alternative solutions, and Philipp Winter remarked that while bridges on port 443 “would easily fall prey to Internet-wide scanning”, “they would still be useful for users behind captive portals” and other adversaries that restrict connections to a limited range of ports.\n\nAlden Page announced that development will soon begin on a free-software tool to counteract “stylometry” attacks, which attempt to deanonymize the author of a piece of text based on their writing style alone. “I hope you will all agree that this poses a significant threat to the preservation of the anonymity of Tor users”, wrote Alden. “In the spirit of meeting the needs of the privacy community, I am interested in hearing what potential users might have to say about the design of such a tool.” Please see Alden’s post for further discussion of stylometry attacks and the proposed countermeasures, and feel free to respond with your comments or questions.\n\nTor help desk roundup\n\nBecause Tor Browser prevents users from running it as root, Kali Linux users starting Tor Browser will see an error message saying Tor should not be run as root.\n\nIn Kali, all userspace software runs as root by default. To run Tor Browser in Kali Linux, create a new user account just for using Tor Browser. Unpack Tor Browser and chown -R your whole Tor Browser directory. Run Tor Browser as your created Tor Browser user account.\n\n\n\nThis issue of Tor Weekly News has been assembled by Harmony, TheCthulhu, Matt Pagan, Arlo Breault, and Karsten Loesing.\n\nWant to continue reading TWN? Please help us create this newsletter. We still need more volunteers to watch the Tor community and report important news. Please see the project page, write down your name and subscribe to the team mailing list if you want to get involved!\n",
            "link": "http://tor.jmtodaro.com//tor-weekly-news-—-december-17th-2014",
            "date": "2014-12-17 01:00:00 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Solidarity against online harassment",
            "content": "One of our colleagues has been the target of a sustained campaign of harassment for the past several months. We have decided to publish this statement to publicly declare our support for her, for every member of our organization, and for every member of our community who experiences this harassment. She is not alone and her experience has catalyzed us to action. This statement is a start.\n\nThe Tor Project works to create ways to bypass censorship and ensure anonymity on the Internet. Our software is used by journalists, human rights defenders, members of law enforcement, diplomatic officials, and many others. We do high-profile work, and over the past years, many of us have been the targets of online harassment. The current incidents come at a time when suspicion, slander, and threats are endemic to the online world. They create an environment where the malicious feel safe and the misguided feel justified in striking out online with a thousand blows. Under such attacks, many people have suffered — especially women who speak up online. Women who work on Tor are targeted, degraded, minimized and endure serious, frightening threats.\n\nThis is the status quo for a large part of the internet. We will not accept it.\n\nWe work on anonymity technology because we believe in empowering people. This empowerment is the beginning and a means, not the end of the discussion. Each person who has power to speak freely on the net also has the power to hurt and harm. Merely because one is free to say a thing does not mean that it should be tolerated or considered reasonable. Our commitment to building and promoting strong anonymity technology is absolute. We have decided that it is not enough for us to work to protect the world from snoops and censors; we must also stand up to protect one another from harassment.\n\nIt&#39;s true that we ourselves are far from perfect. Some of us have written thoughtless things about members of our own community, have judged prematurely, or conflated an idea we hated with the person holding it. Therefore, in categorically condemning the urge to harass, we mean categorically: we will neither tolerate it in others, nor will we accept it among ourselves. We are dedicated to both protecting our employees and colleagues from violence, and trying to foster more positive and mindful behavior online ourselves.\n\nFurther, we will no longer hold back out of fear or uncertainty from an opportunity to defend a member of our community online. We write tools to provide online freedom but we don&#39;t endorse online or offline abuse. Similarly, in the offline world, we support freedom of speech but we oppose the abuse and harassment of women and others. We know that online harassment is one small piece of the larger struggle that women, people of color, and others face against sexism, racism, homophobia and other bigotry.\n\nThis declaration is not the last word, but a beginning: We will not tolerate harassment of our people. We are working within our community to devise ways to concretely support people who suffer from online harassment; this statement is part of that discussion. We hope it will contribute to the larger public conversation about online harassment and we encourage other organizations to sign on to it or write one of their own.\n\nFor questions about Tor, its work, its staff, its funding, or its world view, we encourage people to directly contact us (Media contact: Kate Krauss, press @ torproject.org). We also encourage people join our community and to be a part of our discussions:\n https://www.torproject.org/about/contact\n https://www.torproject.org/docs/documentation#MailingLists\n\nIn solidarity against online harassment,\n\nRoger Dingledine\n Nick Mathewson\n Kate Krauss\n Wendy Seltzer\n Caspar Bowden\n Rabbi Rob Thomas\n Karsten Loesing\n Matthew Finkel\n Griffin Boyce\n Colin Childs\n Georg Koppen\n Tom Ritter\n Erinn Clark\n David Goulet\n Nima Fatemi\n Steven Murdoch\n Linus Nordberg\n Arthur Edelstein\n Aaron Gibson\n Anonymous Supporter\n Matt Pagan\n Philipp Winter\n Sina Rabbani\n Jacob Appelbaum\n Karen Reilly\n Meredith Hoban Dunn\n Moritz Bartl\n Mike Perry\n Sukhbir Singh\n Sebastian Hahn\n Nicolas Vigier\n Nathan Freitas\n meejah\n Leif Ryge\n Runa Sandvik\n Andrea Shepard\n Isis Agora Lovecruft\n Arlo Breault\n Ásta Helgadóttir\n Mark Smith\n Bruce Leidl\n Dave Ahmad\n Micah Lee\n Sherief Alaa\n Virgil Griffith\n Rachel Greenstadt\n Andre Meister\n Andy Isaacson\n Gavin Andresen\n Scott Herbert\n Colin Mahns\n John Schriner\n David Stainton\n Doug Eddy\n Pepijn Le Heux\n Priscilla Oppenheimer\n Ian Goldberg\n Rebecca MacKinnon\n Nadia Heninger\n Cory Svensson\n Alison Macrina\n Arturo Filastò\n Collin Anderson\n Andrew Jones\n Eva Blum-Dumontet\n Jan Bultmann\n Murtaza Hussain\n Duncan Bailey\n Sarah Harrison\n Tom van der Woerdt\n Jeroen Massar\n Brendan Eich\n Joseph Lorenzo Hall\n Jean Camp\n Joanna Rutkowska\n Daira Hopwood\n William Gillis\n Adrian Short\n Bethany Horne\n Andrea Forte\n Hernán Foffani\n Nadim Kobeissi\n Jakub Dalek\n Rafik Naccache\n Nathalie Margi\n Asheesh Laroia\n Ali Mirjamali\n Huong Nguyen\n Meerim Ilyas\n Timothy Yim\n Mallory Knodel\n Randy Bush\n Zachary Weinberg\n Claudio Guarnieri\n Steven Zikopoulos\n Michael Ceglar\n Henry de Valence\n Zachariah Gibbens\n Jeremy M. Harmer\n Ilias Bartolini\n René Pfeiffer\n Percy Wegmann\n Tim Sammut\n Neel Chauhan\n Matthew Puckey\n Taylor R Campbell\n Klaus Layer\n Colin Teberg\n Jeremy Gillula\n Will Scott\n Tom Lowenthal\n Rishab Nithyanand\n Brinly Taylor\n Craig Colman-Shepherd\n A. Lizard\n M. C. McGrath\n Ross MacDonald\n Esra&#39;a Al Shafei\n Gulnara Yunusova\n Ben Laurie\n Christian Vandrei\n Tanja Lange\n Markus Kitsinger\n Harper Reed\n Mark Giannullo\n Alyssa Rowan\n Daniel Gall\n Kathryn Cramer\n Camilo Galdos AkA Dedalo\n Ralf-Philipp Weinmann\n Miod Vallat\n Carlotta Negri\n Frederic Jacobs\n Susan Landau\n Jan Weiher\n Donald A. Byrd\n Jesin A.\n Thomas Blanchard\n Matthijs Pontier\n Rohan Nagel\n Cyril Brulebois\n Neal Rauhauser\n Sonia Ballesteros Rey\n Florian Schmitt\n Abdoulaye Bah\n Simone Basso\n Charlie Smith\n Steve Engledow\n Michael Brennan\n Jeffrey Landale\n Sophie Toupin\n Dana Lane Taylor\n Nagy Gabor\n Shaf Patel\n Augusto Amaral\n Robin Molnar\n Jesús Cea Avión\n praxis journal\n Jens Stomber\n Noam Roberts\n Ken Arroyo Ohori\n Brian Kroll\n Shawn Newell\n Rasmus Vuori\n Alexandre Guédon\n Seamus Tuohy\n Virginia Lange\n Nicolas Sera-Leyva\n Jonah Silas Sheridan\n Ross McElvenny\n Aaron Zauner\n Christophe Moille\n Micah Sherr\n Gabriel Rocha\n Yael Grauer\n Kenneth Freeman\n Dennis Winter\n justaguy\n\nLee Azzarello\n Zaki Manian\n Aaron Turner\n Greg Slepak\n Ethan Zuckerman\n Pasq Gero\n Pablo Suárez-Serrato\n Kerry Rutherford\n Andrés Delgado\n Tommy Collison\n Dan Luedders\n Flávio Amieiro\n Ulrike Reinhard\n Melissa Anelli\n Bryan Fordham\n Nate Perkins\n Jon Blanchard\n Jonathan Proulx\n Bunty Saini\n Daniel Crowley\n Matt Price\n Charlie McConnell\n Chuck Peters\n Ejaz Ahmed\n Laura Poitras\n Benet Hitchcock\n Dave Williams\n Jane Avriette\n Renata Avila\n Sandra Ordonez\n David Palma\n Andre N Batista\n Steve Bellovin\n James Renken\n Alyzande Renard\n Patrick Logan\n Rory Byrne\n Holly Kilroy\n Phillipa Gill\n Mirimir\n Leah Carey\n Josh Steiner\n Benjamin Mako Hill\n Nick Feamster\n Dominic Corriveau\n Adrienne Porter Felt\n str4d\n Allen Gunn\n Eric S Johnson\n Hanno Wagner\n Anders Hansen\n Alexandra Stein\n Tyler H. Meers\n Shumon Huque\n James Vasile\n Andreas Kinne\n Johannes Schilling\n Niels ten Oever\n David W. Deitch\n Dan Wallach\n Jon Penney\n Starchy Grant\n Damon McCoy\n David Yip\n Adam Fisk\n Jon Callas\n Aleecia M. McDonald\n Marina Brown\n Wolfgang Britzl\n Chris Jones\n Heiko Linke\n David Van Horn\n Larry Brandt\n Matt Blaze\n Radek Valasek\n skruffy\n Galou Gentil\n Douglas Perkins\n Jude Burger\n Myriam Michel\n Jillian York\n Michalis Polychronakis\n SilenceEngaged\n Kostas Jakeliunas\n Sebastiaan Provost\n Sebastian Maryniak\n Clytie Siddall\n Claudio Agosti\n Peter Laur\n Maarten Eyskens\n Tobias Pulls\n Sacha van Geffen\n Cory Doctorow\n Tom Knoth\n Fredrik Julie Andersson\n Nighat Dad\n Josh L Glenn\n Vernon Tang\n Jennifer Radloff\n Domenico Lupinetti\n Martijn Grooten\n Rachel Haywire\n eliaz\n Christoph Maria Sommer\n J Duncan\n Michael Kennedy Brodhead\n Mansour Moufid\n Melissa Elliott\n Mick Morgan\n Brenno de Winter\n George Scriban\n Ryan Harris\n Ricard S. Colorado\n Julian Oliver\n Sebastian &quot;bastik&quot; G.\n Te Rangikaiwhiria Kemara\n Koen Van Impe\n Kevin Gallagher\n Sven &quot;DrMcCoy&quot; Hesse\n Pavel Schamberger\n Phillip M. Pether\n Joe P. Lee\n Stephanie Hyland\n Maya Ganesh\n Greg Bonett\n Amadou Lamine Badji\n Vasil Kolev\n Jérémie Zimmermann\n Cally Gordon\n Hakisho Nukama\n Daniel C Howe\n Douglas Stebila\n Jennifer Rexford\n Nayantara Mallesh\n Valeria de Paiva\n Tim Bulow\n Meredith Whittaker\n Max Hunter\n Maja Lampe\n Thomas Ristenpart\n Lisa Wright\n August Germar\n Ronald Deibert\n Harlan Lieberman-Berg\n Alan L. Stewart\n Alexander Muentz\n Erin Benson\n Carmela Troncoso\n David Molnar\n Holger Levsen\n Peter Grombach\n John McIntyre\n Lisa Geelan\n Antonius Kies\n Jörg Kruse\n Arnold Top\n Vladimir G. Ivanovic\n Ahmet A. Sabancı\n Henriette Hofmeier\n Ethan Heilman\n Daniël Verhoeven\n Alex Shepard\n Max Maass\n Ed Agro\n Andrew Heist\n Patrick McDonald\n Lluís Sala\n Laurelai Bailey\n Ghost\n José Manuel Cerqueira Esteves\n Fabio Pietrosanti\n Cobus Carstens\n Harald Lampesberger\n Douwe Schmidt\n Sascha Meinrath\n C. Waters\n Bruce Schneier\n George Danezis\n\nClaudia Diaz\n Kelley Misata\n Denise Mangold\n Owen Blacker\n Zach Wick\n Gustavo Gus\n Alexander Dietrich\n Frank Smyth\n Dafne Sabanes Plou\n Steve Giovannetti\n Grit Hemmelrath\n Masashi Crete-Nishihata\n Michael Carbone\n Amie Stepanovich\n Kaustubh Srikanth\n arlen\n Enrique Piracés\n Antoine Beaupré\n Daniel Kahn Gillmor\n Richard Johnson\n Ashok Gupta\n Alex Halderman\n Brett Solomon\n Raegan MacDonald\n Joseph Steele\n Marie Gutbub\n Valeria Betancourt\n Konstantin Müller\n Emma Persky\n Steve Wyshywaniuk\n Tara Whalen\n Joe Justen\n Susan Kentner\n Josh King\n Juha Nurmi\n John Saylor\n Jurre van Bergen\n Saedu Haiza\n Anders Damsgaard\n Sadia Afroz\n Nat Meysenburg\n x3j11\n Julian Assange\n Skyhighatrist\n Dan Staples\n Grady Johnson\n Matthew Green\n Cameron Williams\n Roy Johnson\n Laura S Potter-Brown\n Meredith L. Patterson\n Casey Dunham\n Raymond Johansen\n Kieran Thandi\n Jason Gulledge\n Matt Weeks\n Khalil Sehnaoui\n Brennan Novak\n Casey Jones\n Jesse Victors\n Peter DeChristo\n Nick Black\n Štefan Gurský\n Glenn Greenwald\n hinterland3r\n Russell Handorf\n Lisa D Lowe\n Harry Halpin\n Cooper Quintin\n Mark Burdett\n Conrad Corpus\n Steve Revilak\n Nate Shiff\n Annie Zaman\n Matthew Miller (Fedora Project)\n David Fetter\n Gabriella Biella Coleman\n Ryan Lackey\n Peter Clemenko\n Serge Egelman\n David Robinson\n Sasa Savic\n James McWilliams\n Arrigo Triulzi\n Kevin Bowen\n Kevin Carson\n Sajeeb Bhowmick\n Dominik Rehm\n William J. Coldwell\n Niall Madhoo\n Christoph Mayer\n Simone Fischer-Hübner\n George W. Maschke\n Jens Kubieziel\n Dan Hanley\n Robin Jacks\n Zenaan Harkness\n Pete Newell\n Aaron Michael Johnson\n Kitty Hundal\n Sabine &quot;Atari-Frosch&quot; Engelhardt\n Wilton Gorske\n Lukas Lamla\n Kat Hanna\n Polly Powledge\n Sven Guckes\n Georgia Bullen\n Vladan Joler\n Eric Schaefer\n Ly Ngoc Quan Ly\n Martin Kepplinger\n Freddy Martinez\n David Haren\n Simon Richter\n Brighid Burns\n Peter Holmelin\n Davide Barbato\n Neil McKay\n Joss Wright\n Troy Toman\n Morana Miljanovic\n Simson Garfinkel\n Harry Hochheiser\n Malte Dik\n Tails project\n „nuocu\n Kurt Weisman\n BlacquePhalcon\n Shaikh Rafia\n Olivier Brewaeys\n Sander Venema\n James Murphy\n Chris &quot;The Paucie&quot; Pauciello\n Syrup-tan\n Brad Parfitt\n Jerry Whiting\n Massachusetts Pirate Party\n András Stribik\n Alden Page\n Juris Vetra\n Zooko Wilcox-O&#39;Hearn\n Marcel de Groot\n Ryan Henry\n Joy Lowell\n Guilhem Moulin\n Werner Jacob\n Tansingh S. Partiman\n Bryce Alexander Lynch\n Robert Guerra\n John Tait\n Sebastian Urbach\n Atro Tossavainen\n Alexei Czeskis\n Greg Norcie\n Greg Metcalfe\n Benjamin Chrobot\n Lorrie Faith Cranor\n Jamie D. Thomas\n EJ Infeld\n Douglas Edwards\n Cody Celine\n Ty Bross\n Matthew Garrett\n Sam P.\n Vidar Waagbø\n Raoul Unger\n Aleksandar Todorović\n John Olinda\n Graham Perkins\n Casa Casanova\n James Turnbull\n Eric Hogue\n Jacobo Nájera\n Ben Adida  \n\nIf you would like to be on this list of signers (please do — you don&#39;t have to be a part of Tor to sign on!), please reach us at tor-assistants @ torproject.org.\n",
            "link": "http://tor.jmtodaro.com//solidarity-against-online-harassment",
            "date": "2014-12-11 08:47:50 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor Weekly News — December 10th, 2014",
            "content": "Welcome to the forty-ninth issue in 2014 of Tor Weekly News, the weekly newsletter that covers what’s happening in the Tor community.\n\nTor Browser 4.0.2 and 4.5-alpha-2 are out\n\nGeorg Koppen announced new stable and alpha releases by the Tor Browser team. Tor Browser 4.0.2 fixes the Windows compiler bugs that were resulting in frequent crashes, ensures entries in the cache are once again isolated by URL bar domain, and prevents the user’s locale setting from being leaked by the JavaScript engine. Tor Browser 4.5-alpha-2 brings further improvements to Torbutton’s new circuit visualization panel, which can now be turned off by visiting about:config and setting “extensions.torbutton.display_circuit” to “false”, as well as to the security slider.\n\nBoth releases contain important security updates and all users should upgrade as soon as possible; please see Georg’s post for full details. You can obtain your copy from the project page, or through the in-browser updater.\n\nTails 1.2.1 is out\n\nThe Tails team announced a new version of the amnesic live operating system. Alongside updates to Linux and Tor Browser, Tails 1.2.1 finally disables the Truecrypt encryption manager, which was abandoned by its developers earlier this year. There have been warnings about this change for several months, but users who have not yet migrated their data away from Truecrypt (or who are not able to) can still access these volumes with cryptsetup by following Tails’ own guide.\n\nThe default configuration of GnuPG has also been changed in line with accepted best practices. If you want to take advantage of this, there is a simple step you need to perform; please see the team’s post for more details, and get your copy of the new Tails from the download page or through the incremental updater.\n\nMore monthly status reports for November 2014\n\nThe wave of regular monthly reports from Tor project members for the month of November continued, with reports from Pearl Crescent, Sukhbir Singh, Leiah Jansen, Matt Pagan, Arlo Breault, Colin C., and Nicolas Vigier.\n\nKarsten Loesing reported on behalf of the Tor Network Tools team, and Roger Dingledine sent out the report for SponsorF.\n\nMiscellaneous news\n\nGeorge Kadianakis sent out an updated draft of the proposal to safely collect hidden service statistics from Tor relays.\n\nNick Mathewson gave a talk to the Computer Systems Security class at MIT on the subject of “Anonymous Communication”.\n\nDavid Fifield summarized the costs incurred in November by the infrastructure for the meek pluggable transport.\n\nThe Tails team wondered about the best way to prioritize adding support for pluggable transports: “Assuming we add support for Scramblesuit in Tails 1.3, then what usecases won’t we be supporting, that we could support better with obfs4 or meek?”\n\nusprey wrote up a guide to configuring a Tor relay on a server running Arch Linux: “All and any feedback will be appreciated! Are there any privacy concerns about using pdnsd to cache DNS locally?”\n\nJacob Appelbaum recommended possible ways to reduce the attack surface presented by the kernel and the firewall in Tails. He also compiled a dataset containing historical hashes and signatures of Tails files: “In the future, I’ll write a program that uses the dataset in a useful manner. In an ideal world, we’d have a way to use a Tails disk to verify any other Tails disk.”\n\nTor help desk roundup\n\nUsers often write to find out how they can help the Tor Project. There are several ways to help out.\n\nIf you have access to a server, consider setting up a Tor relay to expand the network, or a bridge relay to help internet users stuck behind censorship.\n\nIf you’re a coder, see if any of the projects on our volunteer page capture your interest. You can also look for tickets on our bug tracker that are filed with the “easy” component if you want to submit some patches.\n\nIf you’re interested in doing outreach, consider joining the Tor Weekly News team.\n\nIf you’d like to get involved with translations, please join a team on our Transifex. If a team for the language you’d like to translate into does not yet exist (check carefully), please go ahead and request a new team. It will take a day or two for the team to be approved, so please be patient.\n\nNews from Tor StackExchange\n\nstrand raised a question about the code regarding rendezvous and introduction points. Within src/or/rendservice.c there are several occurrences of onion_address, and strand wants to know which function catches what from a hidden service. If you can answer this question, please come to Tor’s Q&amp;A page and give us some insights.\n\nThis week in Tor history\n\nA year ago this week, the Freedom of the Press Foundation launched its “Encryption Tools for Journalists” crowdfunding campaign, distributing the proceeds to five free software security projects, including the Tor Project and Tails. As of this writing, 1256 donors have contributed \\$136,977.05 in support of journalists’ right to communicate with sources and carry out research without being subjected to invasive surveillance. Thanks to the FPF and to everyone who has donated so far!\n\n\n\nThis issue of Tor Weekly News has been assembled by Matt Pagan, qbi, David Fifield, Arlo Breault, Karsten Loesing, and Harmony.\n\nWant to continue reading TWN? Please help us create this newsletter. We still need more volunteers to watch the Tor community and report important news. Please see the project page, write down your name and subscribe to the team mailing list if you want to get involved!\n",
            "link": "http://tor.jmtodaro.com//tor-weekly-news-—-december-10th-2014",
            "date": "2014-12-10 01:00:00 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor Browser 4.5-alpha-2 is released",
            "content": "The second alpha release of the 4.5 series is available from the extended downloads page and also from our distribution directory.\n\nTor Browser 4.5-alpha-2 is based on Firefox ESR 31.3.0, which features important security updates to Firefox. Additionally, it fixes a regression which caused third party authentication credentials to remain undeleted and contains smaller improvements to the circuit UI and the security slider.\n\nHere is the changelog since 4.5-alpha-1:\n\n\n  All Platforms\n\n\n  Update Firefox to 31.3.0esr\n  Update NoScript to 2.6.9.5\n  Update HTTPS Everywhere to 5.0developement.1\n  Update Torbutton to 1.8.1.2\n\n\n  Bug 13672: Make circuit display optional\n  Bug 13671: Make bridges visible on circuit display\n  Bug 9387: Incorporate user feedback\n  Bug 13784: Remove third party authentication tokens\n\n  Bug 13435: Remove our custom POODLE fix (fixed by Mozilla in 31.3.0esr)\n\n\n",
            "link": "http://tor.jmtodaro.com//tor-browser-45-alpha-2-released",
            "date": "2014-12-04 20:03:01 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tails 1.2.1 is out",
            "content": "Tails, The Amnesic Incognito Live System, version 1.2.1, is out.\n\nThis release fixes numerous security issues and all users must upgrade as soon as possible.\n\nChanges\n\nNotable user-visible changes include:\n\n\n  Security fixes\n\n\n  Upgrade Linux to 3.16.7-1.\n  Install Tor Browser 4.0.2 (based on Firefox 31.3.0esr).\n\n  Bugfixes\n\n\n  Restore mouse scrolling in KVM/Spice (ticket #7426).\n  Suppress excessive (and leaky!) Torbutton logging (ticket #8160).\n  Don&#39;t break the Unsafe and I2P Browsers after installing incremental upgrades (ticket #8152, ticket #8158).\n  External links in various applications should now open properly in the Tor Browser (ticket #8153, ticket #8186).\n  Fix clearsigning of text including non-ASCII characters in gpgApplet (ticket #7968).\n\n  Minor improvements\n\n\n  Upgrade I2P to 0.9.17-1~deb7u+1.\n  Make GnuPG configuration closer to the best practices (ticket #7512).\n  Remove TrueCrypt support and document how to open TrueCrypt volumes using cryptsetup (ticket #5373).\n\n\n\nSee the online Changelog for technical details.\n\nKnown issues\n\n\n  Users of the GnuPG keyrings and configuration persistence feature should follow some manual steps after upgrading a Tails USB stick or SD card installation to Tails 1.2.1.\n  Longstanding known issues.\n\n\nI want to try it or to upgrade!\n\nGo to the download page.\n\nAs no software is ever perfect, we maintain a list of problems that affects the last release of Tails.\n\nWhat&#39;s coming up?\n\nThe next Tails release is scheduled for January 14.\n\nHave a look at our roadmap to see where we are heading to.\n\nDo you want to help? There are many ways you can contribute to Tails. If you want to help, come talk to us!\n\nSupport and feedback\n\nFor support and feedback, visit the Support section on the Tails website.\n",
            "link": "http://tor.jmtodaro.com//tails-121-out",
            "date": "2014-12-03 05:29:43 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor Browser 4.0.2 is released",
            "content": "A new release for the stable Tor Browser is available from the Tor Browser Project page and also from our distribution directory.\n\nTor Browser 4.0.2 is based on Firefox ESR 31.3.0, which features important security updates to Firefox. Additionally, it fixes a regression in third party cache isolation (tracking protection) that appeared in 4.0, and prevents JavaScript engine locale leaks. Moreover, we believe we have fixed all of the Windows crashes that were due to mingw-w64 compiler bugs. DirectShow is still disabled by default, though, to give the respective mingw-w64 patch another round of testing.\n\nHere is the changelog since 4.0.1:\n\n\n  All Platforms\n\n\n  Update Firefox to 31.3.0esr\n  Update NoScript to 2.6.9.5\n  Update HTTPS Everywhere to 4.0.2\n  Update Torbutton to 1.7.0.2\n\n\n  Bug 13019: Synchronize locale spoofing pref with our Firefox patch\n  Bug 13746: Properly link Torbutton UI to thirdparty pref.\n\n  Bug 13742: Fix domain isolation for content cache and disk-enabled\n browsing mode\n  Bug 5926: Prevent JS engine locale leaks (by setting the C library\n locale)\n  Bug 13504: Remove unreliable/unreachable non-public bridges\n  Bug 13435: Remove our custom POODLE fix (fixed by Mozilla in 31.3.0esr)\n\n  Windows\n\n\n  Bug 13443: Fix DirectShow-related crash with mingw patch.\n  Bug 13558: Fix crash on Windows XP during download folder changing\n  Bug 13594: Fix update failure for Windows XP users\n\n\n",
            "link": "http://tor.jmtodaro.com//tor-browser-402-released",
            "date": "2014-12-03 03:05:36 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor Weekly News — December 3rd, 2014",
            "content": "Welcome to the forty-eighth issue in 2014 of Tor Weekly News, the weekly newsletter that covers what’s happening in the Tor community.\n\nGetTor is back\n\nSome Tor users need to access the Internet from networks so heavily censored that they cannot reach the Tor Project website, or any of its mirrors, to download Tor in the first place; with these users in mind, GetTor, an alternative software distribution system for Tor Browser, was created.\n\nAfter a period of neglect, GetTor has been revamped and redeployed: users can now email the name of their operating system to gettor@torproject.org, and in return they will receive Dropbox download links for the latest Tor Browser and the package signature, as well as a checksum and the fingerprint of the key used to make the signature.\n\nThe lead developer on this project is Israel Leiva, who did most of the work on it during this year’s Google Summer of Code. Israel took to the Tor blog to explain the background and outcome of the redevelopment work; please see that post for more information, or put GetTor to the test yourself and send your comments to the community!\n\nMonthly status reports for November 2014\n\nThe wave of regular monthly reports from Tor project members for the month of November has begun. Damian Johnson released his report first, followed by reports from Juha Nurmi, George Kadianakis, David Goulet, Philipp Winter, Sherief Alaa, Tom Ritter, Nick Mathewson, Georg Koppen, Griffin Boyce, Karsten Loesing, Andrew Lewman (for both October and November), Noel Torres, and Harmony.\n\nGeorge Kadianakis also sent out the SponsorR report, while Colin C. reported on behalf of the help desk, and Mike Perry for the Tor Browser team.\n\nMiscellaneous news\n\nNathan Freitas announced version 14.1.4 of Orbot, the Tor client for Android, which brings with it further improvements to background service operation, as well as theme and layout tweaks.\n\nAfter much back-and-forth, work by Andrea Shepard to make Tor’s cell scheduling mechanism more efficient was finally merged. Although performance is not yet affected, these changes could form the basis of other improvements to managing congestion caused by “mismanaged socket output” in the Tor network, as discussed by Jansen et al. in “Never Been KIST”.\n\nFollowing a discussion with David Goulet, Nick Mathewson posted a draft proposal of possible improvements to integration testing for Tor.\n\nSebastian Hahn informed users of the Tor Project’s git repositories that cloning via the unauthenticated git:// protocol is no longer supported — secure https:// access has been and still is the preferred method for retrieving code.\n\nGareth Owen started a discussion of suspicious relay behaviors that automated Tor network tests could scan for, in addition to those that are already monitored.\n\nTor help desk roundup\n\nThe help desk has been asked how to set up a relay on a Windows laptop. We don’t recommend running a relay on a laptop: the relays that are most useful to the network have faster bandwidth than most home internet connections can offer. Relays also need to have as much uptime as possible, and a laptop that gets put to sleep and woken up once a week or more is not a good computing environment for a relay that should serve the network in a consistent way.\n\nWe are not able to provide much help to users who report errors when using any of the Vidalia bundles, as Vidalia is no longer maintained.\n\n\n\nThis issue of Tor Weekly News has been assembled by Matt Pagan, Nick Mathewson, Roger Dingledine, and Harmony.\n\nWant to continue reading TWN? Please help us create this newsletter. We still need more volunteers to watch the Tor community and report important news. Please see the project page, write down your name and subscribe to the team mailing list if you want to get involved!\n",
            "link": "http://tor.jmtodaro.com//tor-weekly-news-—-december-3rd-2014",
            "date": "2014-12-03 01:00:00 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Say hi to the new GetTor",
            "content": "Hello people. It&#39;s been a while since Google Summer of Code 2014 ended, but I wanted to give you a brief review of the work done on GetTor.  \n\nWhat is GetTor?\n\nGetTor is a program that serves Tor Browser over email. In the past, people would make requests by sending emails to GetTor, which would send back Tor Browser as email attachments. In highly censored countries (and places) where the Tor Project website is blocked, GetTor would be a convenient way for people to get access to Tor Browser.\n\nThere were lots of nice features incorporated in GetTor, such as specifying the operating system and language for the package wanted, or sending delay messages to let people know the package was on its way. But Tor Browser started to get larger in size (over 25 MB), to the point where it wasn&#39;t longer possible to send it via most email providers.  \n\nRevamp\n\nIt wasn&#39;t long until a solution for this problem came up. The idea consisted on uploading Tor Browser to the cloud (Dropbox) and when someone asked for it via GetTor, a reply with the links for download was sent. This worked quite well, but the fix was far from being complete and at that point the whole GetTor was in need of some love to get back to its shiny days.  \n\nGoogle Summer of Code\n\nAll of what I mentioned was listed on the Volunteer page of the Tor Project website, so when I got there looking for a project to work on for the Google Summer of Code, I immediatly considered it into my options, because of the social impact of GetTor as for the technical skills required. I was happy to learn that my proposal got accepted and I was one of the fourteen students selected to work on the Tor Project during the northern hemisphere summer (actually, it was winter here in Chile).\n\nFirst, I started to work on the design, making sure that when I started to code, most of the ideas I would be implementing were carefully described and discussed. Of course, a lot of things did change over the coding period, some of them small stuff like how the links would be internally stored by GetTor, and some of them not so small, like changing one of the distribution modules.\n\nAnyhow, I don&#39;t want to bore you with technical details here, but if you&#39;re interested, please read my biweekly reports and check the code repository.  \n\nOutcome\n\nThe coding period lasted a little more than three months, and I managed to pass both mid-term and final evaluations. But more importantly, the status of GetTor improved significantly during that time. I did a full rewrite of it, focusing on having clean and readable code, and on making it easy to add new distribution modules and cloud providers for storing Tor Browser. Two distribution modules were successfully finished: SMTP, for asking via email; and XMPP, for asking via Jabber (you know, chat style).\n\nEven though the new GetTor is able to manage requests in multiple locales, for now the SMTP module has been deployed with support for English requests only; other locales and modules will eventually/gradually be supported. We will let you know when that happens (soon we hope!).\n\nAlmost all of the testing and other minor fixes were done after the Google Summer of Code ended, and this is because I explicitly mentioned to my mentors that I have the intention to keep working on it and to continue as the lead developer if needed. It&#39;s not just for the work I did, but more importantly for the possibility of helping other people, specially those that have the bad fortune to live under regimes and/or organizations which think they can impose control on the information you can access, spy on what you do and chase you for what you think. If I have the chance to help avoiding this dystopia, as little as I can, I would certainly do whatever is in my hands, and I invite you to do the same.  \n\nGreat, but how do I use it?\n\nYou can reach GetTor by sending emails to gettor@torproject.org. To ask for Tor Browser, you just have to send an email with the word windows in the body to get it for Windows, osx to get it for Mac OSX, or linux to get it for Linux. The options are case insentitive, so it doesn&#39;t matter if you send Linux, or linux, or LiNuX, as long as it describes one of the options mentioned before; if you send anything different from that, you will receive a help message with detailed instructions on how to interact with it. Once you ask for Tor Browser, GetTor will reply to you with Dropbox links to download the required package for your architecture (32/64 bit) and operating system, along with some extra information to help you verify the integrity of the downloaded files. Please note that you can reach GetTor from any email address: gmail, yahoo, hotmail, riseup, etc. The only restriction is that you can do a maximum of three requests in a row, after that you&#39;ll have to wait 20 minutes to reach GetTor again. You can find out more about its purpose and how it works here.  \n\nCollaborate\n\nThe main way to collaborate is to use GetTor and provide feedback! Please tell us what you like, what you don&#39;t like, what works smoothly and what doesn&#39;t work or could work better; after all, GetTor is here for you, so you should tell us what we need to do :) For this, please open a ticket on the trac system under the GetTor component. You can file anything from usability suggestions/bugs to new development ideas.\n\nOn the other hand, I&#39;ve read lots of people who are interested to collaborate with the Tor Project and they just don&#39;t know where to start or they are looking for something easy to collaborate with. The code and work on GetTor is quite straightforward, so if you know some Python and have some free time that you feel you want to give to an awesome open source organization, check the git repository and the tickets and you might find something easy to start with. There are various ideas and things left to do in GetTor, so please join us!  \n\nOther options\n\nIt&#39;s important to note that there are a couple more options to obtain Tor Browser when you cannot access Tor Project&#39;s website. The first and easiest is to access the official mirrors: EFF and torservers.net. If those sites are blocked too, you can try using Satori, an app for Google Chrome that distributes various circumvention tools in a difficult-to-block way, making it easy for users to check if the software has been tampered. If after all, you manage to get the Tor Browser but you are not able to reach the Tor network, you might want to use bridges or the pluggable transports. You can read more about that here, here and here.\n\nThanks\n\nI want to end this blog post by thanking to the Tor Project organization in general for letting me be part of it during the summer and kindly answer any doubt that came up, and to Sukhbir and Nima in particular for their awesome job as mentors, I couldn&#39;t have done it without you, thanks a lot guys!  \n",
            "link": "http://tor.jmtodaro.com//say-hi-new-gettor",
            "date": "2014-11-26 06:22:42 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor Weekly News — November 26th, 2014",
            "content": "Welcome to the forty-seventh issue in 2014 of Tor Weekly News, the weekly newsletter that covers what’s happening in the Tor community.\n\nA new Tor directory authority\n\nTor, being free software, can be used by anyone to set up their own anonymity network, as Tom Ritter demonstrated last month; but “the Tor network” as we know it today consists of the 6500+ relays voted on by nine “directory authorities” (or “dirauths”), operated by trusted members of the Tor development team and community.\n\nAs Mike Perry, a longtime directory authority operator, wished to retire his machine, “turtles”, without unbalancing the number of authorities producing the consensus, a new authority named “longclaw” was brought online by the autonomous tech collective Riseup, which has been offering free and secure methods of communication (most of them now available as hidden services) since 1999.\n\nThanks to Riseup for playing this key role in the operation of the Tor network!\n\nMiscellaneous news\n\nNathan Freitas announced the release of Orbot 14.1.3, which includes improved handling of background processes; it builds on the earlier 14.1.0, which brought with it support for Android 5.0 Lollipop, as well as stability fixes. Orweb was brought up to version 0.7, also introducing support for the new Android release.\n\nGeorge Kadianakis sent out a co-authored draft of a proposal for statistics concerning hidden service activity that relays could collect and publish without harming the anonymity or security of users and hidden services, and which might “be useful to Tor developers and to people who want to understand hidden services and the onionspace better.”\n\nTom Ritter drafted a proposal exploring methods a hidden service operator might use to prove to certificate authorities that they control the service’s private key when requesting SSL certificates.\n\nKarsten Loesing spruced up the documentation on the Tor Metrics portal, including a handy glossary of frequently-used Tor-specific terms.\n\nDamian Johnson sketched out a roadmap for further development of Stem, the Tor controller library in Python, welcoming “more general ideas on directions to take Stem, the tor-prompt, and this whole space”.\n\nAndrew Lewman reported on his experiments in mirroring the Tor Project website using the Fastly CDN as well as the BitTorrent Sync application.\n\nFollowing a suggestion that a guide to server hardening should be distributed with the tor software package, Libertas drafted a sample document and asked for reviews. “Please share any opinions or contributions you have. This was written in a little more than an hour, so it’s still a work in progress.”\n\nLibertas also scanned a large number of currently-running Tor relays to check which ssh access authentication methods their servers supported, finding 2051 relays that still permitted password-based ssh authentication. “Generally, it is far more secure to allow only public key auth. The Ubuntu help pages have a good guide on setting up key-based auth”.\n\nSiNA Rabbani noted that a large proportion of Tor exit relays are located in Europe, and called for relay operators to consider running nodes with US hosts. “I am not sure if the reason is lack of Tor-friendly ISPs or people are just too freaked out about the summer of Snowden. I think it’s very wrong to assume that EU countries are not part of the world-wide-wiretap, packets are going through a few internet exchanges anyways.”\n\nThanks to Andy Weber, Matt Kraai, Alexander Dietrich, James Murphy, Jesse Victors, Lucid Networks, mirror-server.de, NTU Open Source Society, and Justaguy for running mirrors of the Tor Project’s website and software!\n\nTor help desk roundup\n\nThe help desk commonly sees questions from users who get error messages when using Vidalia, the graphical Tor controller. Vidalia is unmaintained and many of its features simply do not work any more, so it has been deprecated. For web browsing, only the latest version of Tor Browser should be used. If you were trying to use the (now also defunct) Vidalia Bridge or Relay Bundles, documentation for how to set up bridges and regular relays more effectively without Vidalia can be found on the website.\n\n\n\nThis issue of Tor Weekly News has been assembled by Harmony, Matt Pagan, Roger Dingledine, and Karsten Loesing.\n\nWant to continue reading TWN? Please help us create this newsletter. We still need more volunteers to watch the Tor community and report important news. Please see the project page, write down your name and subscribe to the team mailing list if you want to get involved!\n",
            "link": "http://tor.jmtodaro.com//tor-weekly-news-—-november-26th-2014",
            "date": "2014-11-26 01:00:00 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Quick Summary of recent traffic correlation using netflows",
            "content": "Here’s what you need to know about the recent research study on traffic correlation attacks:\n\nWhile it’s great to see more research on traffic correlation attacks, this is not a new area of research. This is one study on the subject in a controlled environment using one readily available traffic monitoring technology to analyze Tor traffic. The researcher has clarified in the media that it was only 81.4 percent of their experiments not “81 percent of all Tor traffic” as has been reported elsewhere.\n\nThe Tor network provides anonymity by routing the user’s information through multiple servers (usually three) so that it is hard to detect the person’s physical location.\n\nTor protects users by:\n 1) encryption to ensure privacy of data within the Tor network,\n 2) authentication so clients know they&#39;re talking to the relays they meant to talk to, and\n 3) signatures to make sure all clients know the same set of relays.\n\nIn theory it may be possible to track Tor users by linking up their entry and exit points on the network but it is generally very difficult to do so. The Tor network design, however, does not protect against a targeted attack by a global passive adversary (such as the NSA) intent on figuring out whom to investigate through watching and measuring Tor traffic going into and out of the network and correlating the information on both sides. We encourage you to learn more about what Tor does provide.\n\nTor is used by 2.5 million people a day including the general public, journalists, companies, activists, military, and law enforcement and is a very safe, reliable way to protect your privacy on the Internet.\n",
            "link": "http://tor.jmtodaro.com//quick-summary-recent-traffic-correlation-using-netflows",
            "date": "2014-11-24 05:58:11 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor Weekly News — November 19th, 2014",
            "content": "Welcome to the forty-sixth issue in 2014 of Tor Weekly News, the weekly newsletter that covers what’s happening in the Tor community.\n\nTor Browser 4.5-alpha-1 is out\n\nMike Perry announced the first alpha release in the Tor Browser 4.5 series. This version goes some way to restoring one of the features most missed by users following the removal of the now-defunct Vidalia interface from Tor Browser — the ability to quickly visualize the Tor circuit that the current page is using. Clicking on the green Torbutton icon in the Tor Browser window now brings up a small diagram showing the IP addresses of all relays in a circuit, and the states in which they are located; this may help users evaluate the suitability of the circuits their Tor has selected, and also to quickly identify a malicious exit relay if they notice unusual behavior in downloaded pages and files.\n\nAnother key user-facing innovation in this release is the “security slider”. Users can now choose from four security settings in Torbutton’s “Preferences” window — “low (default)”, “medium-low”, “medium-high”, and “high” — that allow them to customize their Tor Browser based on their own security and usability needs, while still working to prevent “partitioning” attacks, which try to identify users based on their unusual browser configuration.\n\nFor other important additions in this series, please see the full changelog in Mike’s post. If you want to try out this alpha version, you can find it on the Tor Browser project page or in the distribution directory; please report any bugs you find!\n\nTor Browser on 32-bit Macs approaches end-of-life\n\nNow that Apple has discontinued support for the last remaining 32-bit Mac systems, Mike Perry announced that the Tor Browser team will soon stop distributing 32-bit builds of its software. This week’s 4.5-alpha-1, like all future releases in the 4.5 series, is only available in a 64-bit build, and all support for 32-bit systems will end once 4.5 supersedes 4.0.\n\n“32-bit Mac users likely have a month or two to decide what to do”, wrote Mike. “If your actual Mac hardware is 64-bit capable, you can upgrade to either the 64-bit edition of OSX 10.6 (which we will continue to support for a bit longer), or use the app store to upgrade to 10.9 or 10.10. If your hardware is not 64-bit capable and won’t run these newer Mac operating systems, you should still be able to use Tails, which contains the Tor Browser.”\n\nAs a side effect of this transition, Tor Browser 4.0’s experimental in-browser secure updater will not handle the upgrade to the 64-bit build correctly for any Mac user; the old version must instead be replaced manually with the new one.\n\nMiscellaneous news\n\nRoger Dingledine and Sambuddho Chakravarty responded on the Tor blog to inaccurate reports of a new attack against Tor, based on a recent study co-authored by Sambuddho. “It’s great to see more research on traffic correlation attacks, especially on attacks that don’t need to see the whole flow on each side. But it’s also important to realize that traffic correlation attacks are not a new area”, wrote Roger.\n\nThe Tails team set out the December release schedule for version 1.2.1 of the anonymous live operating system.\n\nGiovanni Pellerano announced version 3.1.30 of Tor2web, which now supports web access to Tor hidden services over TLS. Access to the Facebook hidden service, the most high-profile instance of an HTTPS-enabled .onion site, is blocked in this version, as Tor2web offers no benefit in cases where there exists an identical service on the regular or “naked” web, and may actually present additional risk of compromise.\n\nGriffin Boyce requested feedback on a “very rough” version of Stormy, the simple hidden service setup wizard. “I’d love to get feedback on places where it breaks and where it could use a major structural change […] the current setup is entirely for development and should not be used as-is.”\n\nVirgil Griffith started a discussion on the suitability of the name “hidden services” as opposed to other possible terms like “onion service” or “onion site”. Among the many responses, Roger Dingledine suggested that an alternative name like “onion service” “makes people have to learn what it is rather than guessing (and often guessing wrong)”, while Nathan Freitas pointed out that as “typical users don’t talk about web services, they talk about web sites or pages”, “onion site” might be a term worth adopting.\n\nTom Ritter put forward a number of improvements to the integration of HTTPS certificates and hidden services, following “a spirited debate on IRC”.\n\nThe Wikimedia Foundation is the latest high-profile organization to set up a non-exit Tor relay. “It’s just a small contribution to the network. Really — anyone can do it.”\n\n\n\nThis issue of Tor Weekly News has been assembled by Harmony and Lunar.\n\nWant to continue reading TWN? Please help us create this newsletter. We still need more volunteers to watch the Tor community and report important news. Please see the project page, write down your name and subscribe to the team mailing list if you want to get involved!\n",
            "link": "http://tor.jmtodaro.com//tor-weekly-news-—-november-19th-2014",
            "date": "2014-11-19 01:00:00 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor Browser 4.5-alpha-1 is released",
            "content": "The first alpha release of the 4.5 series is available from the extended downloads page and also from our distribution directory.\n\nThis release features a circuit status reporting UI (visible on the green Tor onion button menu), as well as isolation for circuit use. All content elements for a website will use a single circuit, and different websites should use different circuits, even when viewed at the same time. The Security Slider is also present in this release, and can be configured from the green Tor onion&#39;s Preferences menu, under the Privacy and Security settings tab. It also features HTTPS certificate pinning for selected sites (including our updater), which was backported from Firefox 32.\n\nThis release also features a rewrite of the obfs3 pluggable transport, and the introduction of the new obfs4 transport. Please test these transports and report any issues!\n\nNote to Mac users: As part of our planned end-of-life for supporting 32 bit Macs, the Mac edition of this release is 64 bit only, which also means that the updater will not work for Mac users on the alpha series release channel for this release. Once you transition to this 64 bit release, the updater should function correctly after that.\n\nHere is the complete changelog since 4.0.1:\n\n\n  All Platforms\n\n\n  Bug 3455: Patch Firefox SOCKS and proxy filters to allow user+pass isolation\n  Bug 11955: Backport HTTPS Certificate Pinning patches from Firefox 32\n  Bug 13684: Backport Mozilla bug #1066190 (pinning issue fixed in Firefox 33)\n  Bug 13019: Make JS engine use English locale if a pref is set by Torbutton\n  Bug 13301: Prevent extensions incompatibility error after upgrades\n  Bug 13460: Fix MSVC compilation issue\n  Bug 13504: Remove stale bridges from default bridge set\n  Bug 13742: Fix domain isolation for content cache and disk-enabled browsing mode\n  Update Tor to 0.2.6.1-alpha\n  Update NoScript to 2.6.9.3\n  Bug 13586: Make meek use TLS session tickets (to look like stock Firefox).\n  Bug 12903: Include obfs4proxy pluggable transport\n  Update Torbutton to 1.8.1.1\n\n\n  Bug 9387: Provide a &quot;Security Slider&quot; for vulnerability surface reduction\n  Bug 13019: Synchronize locale spoofing pref with our Firefox patch\n  Bug 3455: Use SOCKS user+pass to isolate all requests from the same url domain\n  Bug 8641: Create browser UI to indicate current tab&#39;s Tor circuit IPs\n  Bug 13651: Prevent circuit-status related UI hang.\n  Bug 13666: Various circuit status UI fixes\n  Bug 13742+13751: Remove cache isolation code in favor of direct C++ patch\n  Bug 13746: Properly update third party isolation pref if disabled from UI\n\n\n  Windows\n\n\n  Bug 13443: Re-enable DirectShow; fix crash with mingw patch.\n  Bug 13558: Fix crash on Windows XP during download folder changing\n  Bug 13091: Make app name &quot;Tor Browser&quot; instead of &quot;Tor&quot;\n  Bug 13594: Fix update failure for Windows XP users\n\n  Mac\n\n\n  Bug 10138: Switch to 64bit builds for MacOS\n\n\n",
            "link": "http://tor.jmtodaro.com//tor-browser-45-alpha-1-released",
            "date": "2014-11-17 16:15:53 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "End of life plan for Tor Browser on 32 bit Macs",
            "content": "We are planning to discontinue support for 32 bit Macs for Tor Browser.\n\nWe&#39;re doing this for two main reasons. First, Apple itself no longer supports 32 bit Macs. The only remaining 32 bit Mac users are on OSX 10.6, which Apple ended support for in February of this year. Second, 64 bit software has improved security properties by way of improved address space layout randomization (ASLR), which makes exploitation more difficult.\n\nThis transition will happen in phases: First, the upcoming 4.5-alpha series will only be available as 64 bit builds. We will continue releasing 32 bit versions of the 4.0 series until the 4.5 series is declared stable. When the 4.5 release stabilizes, all support for 32 bit Macs will end. The 4.5 release series will be stable &quot;when it&#39;s ready&quot;, but we know we need to perform at least two more releases in this series to properly exercise the new security features in the updater. This means that 32 bit Mac users likely have a month or two to decide what to do.\n\nCurrent 32 bit Mac users have a few options. If your actual Mac hardware is 64 bit capable, you can upgrade to either the 64 bit edition of OSX 10.6 (which we will continue to support for a bit longer), or use the app store to upgrade to 10.9 or 10.10.\n\nIf your hardware is not 64 bit capable and won&#39;t run these newer Mac operating systems, you should still be able to use Tails, which contains the Tor Browser. You can run Tails in a virtual machine such as VirtualBox, or you can manually install it to a USB disk from the Mac OS Terminal. If you install Tails to a USB stick, you will need to reboot your Mac in order to use it.\n\nAll Mac Users: Manual Update Required\n\nThe transition from 32 bit Mac bundles to 64 bit Mac bundles means that our (currently experimental) in-browser updater will not transition any Mac users to the 64bit version automatically, even if your Mac is already running a 64 bit version of Mac OS. You must perform this update manually, as you had to do prior to the 4.0 series. This means downloading the DMG and dragging the new 64 bit Tor Browser over your old Tor Browser, and replacing the application.\n\nOnce you are running the 64 bit version, updates should function correctly again.\n",
            "link": "http://tor.jmtodaro.com//end-life-plan-tor-browser-32-bit-macs",
            "date": "2014-11-17 13:18:41 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Traffic correlation using netflows",
            "content": "People are starting to ask us about a recent tech report from Sambuddho&#39;s group about how an attacker with access to many routers around the Internet could gather the netflow logs from these routers and match up Tor flows. It&#39;s great to see more research on traffic correlation attacks, especially on attacks that don&#39;t need to see the whole flow on each side. But it&#39;s also important to realize that traffic correlation attacks are not a new area.\n\nThis blog post aims to give you some background to get you up to speed on the topic.\n\nFirst, you should read the first few paragraphs of the One cell is enough to break Tor&#39;s anonymity analysis:\n\n\nFirst, remember the basics of how Tor provides anonymity. Tor clients route their traffic over several (usually three) relays, with the goal that no single relay gets to learn both where the user is (call her Alice) and what site she&#39;s reaching (call it Bob).\n\nThe Tor design doesn&#39;t try to protect against an attacker who can see or measure both traffic going into the Tor network and also traffic coming out of the Tor network. That&#39;s because if you can see both flows, some simple statistics let you decide whether they match up.\n\nBecause we aim to let people browse the web, we can&#39;t afford the extra overhead and hours of additional delay that are used in high-latency mix networks like Mixmaster or Mixminion to slow this attack. That&#39;s why Tor&#39;s security is all about trying to decrease the chances that an adversary will end up in the right positions to see the traffic flows.\n\nThe way we generally explain it is that Tor tries to protect against traffic analysis, where an attacker tries to learn whom to investigate, but Tor can&#39;t protect against traffic confirmation (also known as end-to-end correlation), where an attacker tries to confirm a hypothesis by monitoring the right locations in the network and then doing the math.\n\nAnd the math is really effective. There are simple packet counting attacks (Passive Attack Analysis for Connection-Based Anonymity Systems) and moving window averages (Timing Attacks in Low-Latency Mix-Based Systems), but the more recent stuff is downright scary, like Steven Murdoch&#39;s PET 2007 paper about achieving high confidence in a correlation attack despite seeing only 1 in 2000 packets on each side (Sampled Traffic Analysis by Internet-Exchange-Level Adversaries).\n\n\nSecond, there&#39;s some further discussion about the efficacy of traffic correlation attacks at scale in the Improving Tor&#39;s anonymity by changing guard parameters analysis:\n\n\nTariq&#39;s paper makes two simplifying assumptions when calling an attack successful [...] 2) He assumes that the end-to-end correlation attack (matching up the incoming flow to the outgoing flow) is instantaneous and perfect. [...] The second one (&quot;how successful is the correlation attack at scale?&quot; or maybe better, &quot;how do the false positives in the correlation attack compare to the false negatives?&quot;) remains an open research question.\n\nResearchers generally agree that given a handful of traffic flows, it&#39;s easy to match them up. But what about the millions of traffic flows we have now? What levels of false positives (algorithm says &quot;match!&quot; when it&#39;s wrong) are acceptable to this attacker? Are there some simple, not too burdensome, tricks we can do to drive up the false positives rates, even if we all agree that those tricks wouldn&#39;t work in the &quot;just looking at a handful of flows&quot; case?\n\nMore precisely, it&#39;s possible that correlation attacks don&#39;t scale well because as the number of Tor clients grows, the chance that the exit stream actually came from a different Tor client (not the one you&#39;re watching) grows. So the confidence in your match needs to grow along with that or your false positive rate will explode. The people who say that correlation attacks don&#39;t scale use phrases like &quot;say your correlation attack is 99.9% accurate&quot; when arguing it. The folks who think it does scale use phrases like &quot;I can easily make my correlation attack arbitrarily accurate.&quot; My hope is that the reality is somewhere in between — correlation attacks in the current Tor network can probably be made plenty accurate, but perhaps with some simple design changes we can improve the situation.\n\n\nThe discussion of false positives is key to this new paper too: Sambuddho&#39;s paper mentions a false positive rate of 6%. That sounds like it means if you see a traffic flow at one side of the Tor network, and you have a set of 100000 flows on the other side and you&#39;re trying to find the match, then 6000 of those flows will look like a match. It&#39;s easy to see how at scale, this &quot;base rate fallacy&quot; problem could make the attack effectively useless.\n\nAnd that high false positive rate is not at all surprising, since he is trying to capture only a summary of the flows at each side and then do the correlation using only those summaries. It would be neat (in a theoretical sense) to learn that it works, but it seems to me that there&#39;s a lot of work left here in showing that it would work in practice. It also seems likely that his definition of false positive rate and my use of it above don&#39;t line up completely: it would be great if somebody here could work on reconciling them.\n\nFor a possibly related case where a series of academic research papers misunderstood the base rate fallacy and came to bad conclusions, see Mike&#39;s critique of website fingerprinting attacks plus the follow-up paper from CCS this year confirming that he&#39;s right.\n\nI should also emphasize that whether this attack can be performed at all has to do with how much of the Internet the adversary is able to measure or control. This diversity question is a large and important one, with lots of attention already. See more discussion here.\n\nIn summary, it&#39;s great to see more research on traffic confirmation attacks, but a) traffic confirmation attacks are not a new area so don&#39;t freak out without actually reading the papers, and b) this particular one, while kind of neat, doesn&#39;t supercede all the previous papers.\n\n(I should put in an addendum here for the people who are wondering if everything they read on the Internet in a given week is surely all tied together: we don&#39;t have any reason to think that this attack, or one like it, is related to the recent arrests of a few dozen people around the world. So far, all indications are that those arrests are best explained by bad opsec for a few of them, and then those few pointed to the others when they were questioned.)\n\n[Edit: be sure to read Sambuddho&#39;s comment below, too. -RD]\n",
            "link": "http://tor.jmtodaro.com//traffic-correlation-using-netflows",
            "date": "2014-11-14 13:14:41 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor Weekly News — November 12th, 2014",
            "content": "Welcome to the forty-fifth issue in 2014 of Tor Weekly News, the weekly newsletter that covers what’s happening in the Tor community.\n\nMozilla announces Polaris Privacy Initiative\n\nMozilla, makers of the Firefox browser upon which Tor Browser is based, announced a series of projects to “accelerate pragmatic and user-focused advances in privacy technology for the Web, giving users more control, awareness and protection in their Web experiences”. The Tor Project is one of Mozilla’s two partners in this Polaris Privacy Initiative, and the collaboration will involve looking at the Firefox codebase to see if its relationship to Tor Browser and the Tor development process can be made more efficient, giving Tor engineers more time to focus on other important issues. Mozilla also stated their intention to run several high-capacity Tor middle relays, contributing to a faster and more stable Tor network.\n\nAs Andrew Lewman wrote on the Tor blog, “the Tor Browser is one of the best ways to protect privacy on the web and this partnership is a huge step in advancing people’s right to freedom of expression online”. Watch for more announcements as work on these two fronts continues.\n\nTor and Operation Onymous\n\nAn international coalition of law enforcement authorities announced the seizure of over 400 Tor hidden services allegedly engaging in illegal activity. Once the desired headlines had been written, something approaching the facts began to emerge, with the claimed number of seized services dropping sharply to 27; more troublingly, several high-capacity Tor relays with no apparent connection to the hidden services were also seized. However, in contrast to the last major takedown of hidden services, which involved one shared hidden service hosting platform, there was no obvious single feature linking all of the seized sites, leading to concern in the Tor community that an exploit against the Tor network may have been responsible for their discovery.\n\nIt could be that these services were deanonymized individually over a period of months using a variety of means, then all seized at once for maximum effect: as Andrew Lewman and others wrote in a response posted to the Tor blog, these methods could include operational security mistakes by service operators, exploitation of flaws in poorly-written website code, or attacks on the Bitcoin cryptocurrency that is widely used on hidden service marketplaces. On the other hand, if an attack on the Tor network itself is at play, it may be a variant of the class of attack known as “traffic confirmation”, like the one observed earlier this year. “Unfortunately,” as the blog post notes, ”the authorities did not specify how they managed to locate the hidden services”; even if they had, recent disclosures concerning “parallel construction” in law enforcement mean that the public would not necessarily be able to trust their explanation.\n\n“Hidden services need some love” has become a familiar refrain in recent months, and even though the story behind these seizures may remain unknown, they have reinvigorated some long-running threads on improvements to the security of this important technology. George Kadianakis coded a patch that allows hidden service operators to “specify a set of nodes that will be pinned as middle nodes in hidden service rendezvous circuits”, while the theory behind this continues to be discussed, as does the hidden service authorization feature and how widely it is used in practice.\n\n“The attention hidden services have received is minimal compared to their social value and compared to the size and determination of their adversaries.” If you are a hidden service operator concerned by these seizures, or you want to help ensure the possibility of free and uncensorable publishing online, see the group blog post for more details, and feel free to join in with the discussions on the tor-dev mailing list.\n\nMore monthly status reports for October 2014\n\nThe wave of regular monthly reports from Tor project members for the month of October continued, with reports from Isis Lovecruft, Nicolas Vigier, Damian Johnson, and Karsten Loesing.\n\nRoger Dingledine sent out the report for SponsorF.\n\nMiscellaneous news\n\nArturo Filastò reported on OONI’s ongoing study of Tor bridge reachability in different countries, and the recent hackfest on the same topic.\n\nKarsten Loesing offered an update on developments in the world of Onionoo, including new mirrors and search improvements.\n\nHelp desk round up\n\nThe help desk has been asked how to run Tor Browser on a Chromebook. ChromeOS does not allow any programs to be executed except Google Chrome, including other browsers like Tor Browser. The workaround for this is to install a Debian or Ubuntu environment within ChromeOS using crouton. Once crouton is ready, Tor Browser for Linux can be downloaded and installed in the Debian or Ubuntu environment. Crouton users should seek support from the crouton team and not from the Tor help desk.\n\n\n\nThis issue of Tor Weekly News has been assembled by Harmony, Matt Pagan, Karsten Loesing, and Lunar.\n\nWant to continue reading TWN? Please help us create this newsletter. We still need more volunteers to watch the Tor community and report important news. Please see the project page, write down your name and subscribe to the team mailing list if you want to get involved!\n",
            "link": "http://tor.jmtodaro.com//tor-weekly-news-—-november-12th-2014",
            "date": "2014-11-12 01:00:00 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Partnering with Mozilla",
            "content": "Mozilla announced that the Tor Project and the Center for Democracy &amp; Technology will be part of their new privacy initiative called Polaris, a collaboration to bring even more privacy features into Mozilla’s products. We are honored to be working alongside Mozilla as well as the Center for Democracy &amp; Technology to give Firefox users more options to protect their privacy.\n\nWhy Mozilla?\n\nMozilla is an industry leader in developing features to support the user’s desire for increased privacy online and shares the Tor Project&#39;s mission of helping people protect their security online. At the core of Mozilla&#39;s values is the belief that individuals’ privacy cannot be treated as optional. We share this belief. Millions of people around the world rely on the protection of the Tor software and network to safeguard their anonymity. We appreciate companies like Mozilla that see the importance of safeguarding privacy. The Tor volunteer network has grown to the point that large companies can usefully contribute without hurting network diversity. The Tor network will get even better with Mozilla&#39;s help, and we hope that their participation will encourage even more organizations to join us.\n\nThe initial projects with Mozilla will focus on two areas:\n\nEngineering support: \n\nThe Tor Browser is built on the Firefox platform and we are excited to have the resources of Mozilla’s engineers to help us merge the many Firefox privacy fixes into the Mozilla codebase. The increased attention from Mozilla will give us time to focus on finding and fixing new issues rather than maintaining our fork.\n\nNetwork Support:\n\nTor&#39;s network size constrains the number of users that can use Tor concurrently. In the short term, Mozilla will help address this by hosting high-capacity Tor middle relays to make Tor’s network more responsive and allow Tor to serve more users.\n\nWe believe that the Tor Browser is one of the best ways to protect privacy on the web and this partnership is a huge step in advancing people’s right to freedom of expression online.\n",
            "link": "http://tor.jmtodaro.com//partnering-mozilla",
            "date": "2014-11-11 06:17:15 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "OONI Bridge reachability study and hackfest",
            "content": "Has a Tor bridge already been blocked in a given country? Being able to answer that question would allow Tor to provide more efficient circumvention methods to those who need them. OONI, the Open Observatory of Network Interference is now actively collecting data on bridge reachability. We are also interested in having a better understanding of how reactive censors are in blocking new bridges distributed via Tor Browser and how effective they are at inhibiting usage of particular pluggable transport.\n\nThe countries we are focusing on in this survey are China, Iran, Russia and Ukraine. We call these our test vantage points.\n\nFrom every test vantage point we perform two types of measurements:\n\n\n  A Bridge reachability measurement that attempts to build a Tor circuit using the bridge in question.\n  A TCP connect measurement that simply does a TCP connect to the bridge IP and port.\n\n\nTo establish a baseline to eliminate the cases in which the bridge is marked as blocked, while it is in fact just offline, we measure also from a vantage point located in the Netherlands.\n\nSo far we have collected about a month worth of data and it is as always publicly available for download by anybody interested in looking at it.\n\nTo advance this study at the end of October we did a OONI hackfest in Berlin. Helped by the ubiquitous sticky notes we were able to come up with a plan for those days of work and for continuing the project.\n\n\n\nThe first visualisation we produced is that of the reachability of bridges categorised by country and pluggable transport over time. This simple visualisation already conveys a lot of information and has proven itself a useful tool also in debugging issues with ooniprobe and the tools we use.\n\n\n \n\n\nYou can visit the actual page by clicking on the picture above.\n Please note that because the tests are new and experimental you might find inaccuracies or bugs, so don&#39;t seriously rely on it for research just yet.\n\nWe also developed a data pipeline that places all of the collected OONI reports into a database. This makes it much easier to search/aggregate and visualise the data of the reports.\n\nTo read more about this project check out the ooni-dev mailing list thread on this topic.\n\nThis project is still in it&#39;s very early stages of development, but we would love to hear feedback on it or your cool visualization ideas, as well as any questions regarding Tor bridge reachability (or more in general on Internet censorship) that you would like us to answer!\n",
            "link": "http://tor.jmtodaro.com//ooni-bridge-reachability-study-and-hackfest",
            "date": "2014-11-10 00:05:33 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Thoughts and Concerns about Operation Onymous",
            "content": "What happened\n\nRecently it was announced that a coalition of government agencies took control of many Tor hidden services. We were as surprised as most of you. Unfortunately, we have very little information about how this was accomplished, but we do have some thoughts which we want to share.\n\nOver the last few days, we received and read reports saying that several Tor relays were seized by government officials. We do not know why the systems were seized, nor do we know anything about the methods of investigation which were used. Specifically, there are reports that three systems of Torservers.net disappeared and there is another report by an independent relay operator. If anyone has more details, please get in contact with us. If your relay was seized, please also tell us its identity so that we can request that the directory authorities reject it from the network.\n\nBut, more to the point, the recent publications call the targeted hidden services seizures &quot;Operation Onymous&quot; and they say it was coordinated by Europol and other government entities. Early reports say 17 people were arrested, and 400 hidden services were seized. Later reports have clarified that it was hundreds of URLs hosted on roughly 27 web sites offering hidden services. We have not been contacted directly or indirectly by Europol nor any other agency involved.\n\nTor is most interested in understanding how these services were located, and if this indicates a security weakness in Tor hidden services that could be exploited by criminals or secret police repressing dissents. We are also interested in learning why the authorities seized Tor relays even though their operation was targetting hidden services. Were these two events related?\n\nHow did they locate the hidden services?\n\nSo we are left asking &quot;How did they locate the hidden services?&quot;. We don&#39;t know. In liberal democracies, we should expect that when the time comes to prosecute some of the seventeen people who have been arrested, the police would have to explain to the judge how the suspects came to be suspects, and that as a side benefit of the operation of justice, Tor could learn if there are security flaws in hidden services or other critical internet-facing services. We know through recent leaks that the US DEA and others have constructed a system of organized and sanctioned perjury which they refer to as &quot;parallel construction.&quot;\n\nUnfortunately, the authorities did not specify how they managed to locate the hidden services. Here are some plausible scenarios:\n\nOperational Security\n\nThe first and most obvious explanation is that the operators of these hidden services failed to use adequate operational security. For example, there are reports of one of the websites being infiltrated by undercover agents and the affidavit states various operational security errors.\n\nSQL injections\n\nAnother explanation is exploitation of common web bugs like SQL injections or RFIs (remote file inclusions). Many of those websites were likely quickly-coded e-shops with a big attack surface. Exploitable bugs in web applications are a common problem.\n\nBitcoin deanonymization\n\nIvan Pustogarov et al. have recently been conducting interesting research on Bitcoin anonymity.\n\nApparently, there are ways to link transactions and deanonymize Bitcoin clients even if they use Tor. Maybe the seized hidden services were running Bitcoin clients themselves and were victims of similar attacks.\n\nAttacks on the Tor network\n\nThe number of takedowns and the fact that Tor relays were seized could also mean that the Tor network was attacked to reveal the location of those hidden services. We received some interesting information from an operator of a now-seized hidden service which may indicate this, as well. Over the past few years, researchers have discovered various attacks on the Tor network. We&#39;ve implemented some defenses against these attacks, but these defenses do not solve all known issues and there may even be attacks unknown to us.\n\nFor example, some months ago, someone was launching non-targetted deanonymization attacks on the live Tor network. People suspect that those attacks were carried out by CERT researchers. While the bug was fixed and the fix quickly deployed in the network, it&#39;s possible that as part of their attack, they managed to deanonymize some of those hidden services.\n\nAnother possible Tor attack vector could be the Guard Discovery attack. This attack doesn&#39;t reveal the identity of the hidden service, but allows an attacker to discover the guard node of a specific hidden service. The guard node is the only node in the whole network that knows the actual IP address of the hidden service. Hence, if the attacker then manages to compromise the guard node or somehow obtain access to it, she can launch a traffic confirmation attack to learn the identity of the hidden service. We&#39;ve been\n discussing various solutions to the guard discovery attack for the past many months but it&#39;s not an easy problem to fix properly. Help and feedback on the proposed designs is appreciated.\n\n*Similarly, there exists the attack where the hidden service selects the attacker&#39;s relay as its guard node. This may happen randomly or this could occur if the hidden service selects another relay as its guard and the attacker renders that node unusable, by a denial of service attack or similar. The hidden service will then be forced to select a new guard. Eventually, the hidden service will select the attacker.\n\nFurthermore, denial of service attacks on relays or clients in the Tor network can often be leveraged into full de-anonymization attacks. These techniques go back many years, in research such as &quot;From a Trickle to a Flood&quot;, &quot;Denial of Service or Denial of Security?&quot;, &quot;Why I&#39;m not an Entropist&quot;, and even the more recent Bitcoin attacks above. In the Hidden Service protocol there are more vectors for DoS attacks, such as the set of HSDirs and the Introduction Points of a Hidden Service.\n\nFinally, remote code execution exploits against Tor software are also always a possibility, but we have zero evidence that such exploits exist. Although the Tor source code gets continuously reviewed by our security-minded developers and community members, we would like more focused auditing by experienced bug hunters. Public-interest initiatives like Project Zero could help out a lot here. Funding to launch a bug bounty program of our own could also bring real benefit to our codebase. If you can help, please get in touch.\n\nAdvice to concerned hidden service operators\n\nAs you can see, we still don&#39;t know what happened, and it&#39;s hard to give concrete suggestions blindly.\n\nIf you are a concerned hidden service operator, we suggest you read the cited resources to get a better understanding of the security that hidden services can offer and of the limitations of the current system. When it comes to anonymity, it&#39;s clear that the tighter your threat model is, the more informed you need to be about the technologies you use.\n\nIf your hidden service lacks sufficient processor, memory, or network resources the DoS based de-anonymization attacks may be easy to leverage against your service. Be sure to review the Tor performance tuning guide to optimize your relay or client.\n\n*Another possible suggestion we can provide is manually selecting the guard node of a hidden service. By configuring the EntryNodes option in Tor&#39;s configuration file you can select a relay in the Tor network you trust. Keep in mind, however, that a determined attacker will still be able to determine this relay is your guard and all other attacks still apply.\n\nFinal words\n\nThe task of hiding the location of low-latency web services is a very hard problem and we still don&#39;t know how to do it correctly. It seems that there are various issues that none of the current anonymous publishing designs have really solved.\n\nIn a way, it&#39;s even surprising that hidden services have survived so far. The attention they have received is minimal compared to their social value and compared to the size and determination of their adversaries.\n\nIt would be great if there were more people reviewing our designs and code. For example, we would really appreciate feedback on the upcoming hidden service revamp or help with the research on guard discovery attacks (see links above).\n\nAlso, it&#39;s important to note that Tor currently doesn&#39;t have funding for improving the security of hidden services. If you are interested in funding hidden services research and development, please get in touch with us. We hope to find time to organize a crowdfunding campaign to acquire independent and focused hidden service funding.\n\nFinally, if you are a relay operator and your server was recently compromised or you lost control of it, please let us know by sending an email to bad-relays@lists.torproject.org.\n\nThanks to Griffin, Matt, Adam, Roger, David, George, Karen, and Jake for contributions to this post.\n\nUpdates:\n * Added information about guard node DoS and EntryNodes option - 2014/11/09 18:16 UTC\n",
            "link": "http://tor.jmtodaro.com//thoughts-and-concerns-about-operation-onymous",
            "date": "2014-11-09 03:54:45 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor Weekly News — November 5th, 2014",
            "content": "Welcome to the forty-fourth issue in 2014 of Tor Weekly News, the weekly newsletter that covers what’s happening in the Tor community.\n\nTor 0.2.6.1-alpha is out\n\nFollowing last week’s stabilization of Tor 0.2.5.x, Nick Mathewson announced the first alpha release in the Tor 0.2.6.x series. Quoting the changelog, this version “includes numerous code cleanups and new tests, and fixes a large number of annoying bugs. Out-of-memory conditions are handled better than in 0.2.5, pluggable transports have improved proxy support, and clients now use optimistic data for contacting hidden services.” Support for some very old compilers that do not understand the C99 programming standard, systems without threading support, and the Windows CE operating system has also been dropped.\n\n“This is the first alpha release in a new series, so expect there to be bugs.” If you want to test it out, you can find the source code in the distribution directory.\n\nTor Browser 4.0.1 is out\n\nMike Perry announced a bugfix release by the Tor Browser team. This version disables DirectShow, which was causing the Windows build of Tor Browser to crash when visiting many websites. This is not a security release, but Windows users who have experienced this issue should upgrade.\n\nPlease see Mike’s post for the changelog, and download your copy from the project page.\n\nFacebook, hidden services, and HTTPS certificates\n\nFacebook, one of the world’s most popular websites, surprised the Internet by becoming the most prominent group so far to set up a Tor hidden service. Rather than connecting through an exit relay, Facebook users can now interact with the social network without their traffic leaving the Tor network at all until it reaches its destination.\n\nSoon after the service was announced, some in the Tor community expressed concern over the implications of its unusually memorable .onion address. Had Facebook somehow mustered the computing power to brute-force hidden service keys at will? Alec Muffett, one of the lead engineers behind the project, clarified that in fact “we just did the same thing as everyone else: generated a bunch of keys with a fixed lead prefix (‘facebook’) and then went fishing looking for good ones”, getting “tremendous lucky” in the process. Those concerned by how easy this seems, added Nick Mathewson, “might want to jump in on reviewing and improving proposal 224, which includes a brand-new, even less usable, but far more secure, name format”.\n\n“Why would you want to use Facebook over Tor?” remains a frequently-asked (and -misunderstood) question, so Roger Dingledine took to the Tor blog to address this and related issues. “The key point here is that anonymity isn’t just about hiding from your destination. There’s no reason to let your ISP know when or whether you’re visiting Facebook. There’s no reason for Facebook’s upstream ISP, or some agency that surveils the Internet, to learn when and whether you use Facebook. And if you do choose to tell Facebook something about you, there’s still no reason to let them automatically discover what city you’re in today while you do it.” Not only that, but Facebook is now taking advantage of the special security properties that hidden services provide, including strong authentication (letting users be confident that they are talking to the right server, and not to an impostor) and end-to-end encryption of their data.\n\nThis last point generated some confusion, since Facebook have also acquired an HTTPS certificate for their hidden service, which might seem like an unnecessary belt-and-suspenders approach to security. This has been the subject of “feisty discussions” in the Internet security community, with many points for and against: on the one hand, users have been taught that “https is necessary and http is scary, so it makes sense that users want to see the string “https” in front of” URLs, while on the other, “by encouraging people to pay Digicert we’re reinforcing the certificate authority business model when maybe we should be continuing to demonstrate an alternative.”\n\nPlease see Roger’s post for a fuller discussion of all these points and more, and feel free to contribute your own thoughts on the tor-talk mailing list. If you experience problems with the service, please contact Facebook support rather than the Tor help desk; as Alec wrote in the announcement, “we expect the service to be of an evolutionary and slightly flaky nature”, as it is an “experiment” — hopefully an experiment that will, as Roger suggested, “help to continue opening people’s minds about why they might want to offer a hidden service, and help other people think of further novel uses for hidden services.”\n\nMonthly status reports for October 2014\n\nThe wave of regular monthly reports from Tor project members for the month of October has begun. Juha Nurmi released his report first, followed by reports from Georg Koppen, Sherief Alaa, Pearl Crescent, Lunar, Harmony, Sukhbir Singh, Colin C., Leiah Jansen, Nick Mathewson, Arlo Breault, Noel Torres, and George Kadianakis.\n\nLunar reported on behalf of the help desk, Arturo Filastò for the OONI team, and Mike Perry for the Tor Browser team.\n\nMiscellaneous news\n\nMike Perry updated the Tor Browser design document to cover Tor Browser version 4.0 — “Feedback welcome! Patches are even more welcomer!”\n\nIsrael Leiva sent out an update on the progress of the GetTor redevelopment project.\n\nDavid Fifield distributed a graph of “the number of simultaneous relay users for every country, one country per row”.\n\nDavid also sent out a summary of the costs incurred by the meek pluggable transport, which have increased significantly following its incorporation into the latest stable Tor Browser and the consequent “explosion” in use.\n\nEsfandiar Mohammadi announced the MATor project and accompanying paper. MATor is a tool that “assesses the influence of Tor’s path selection on a user’s anonymity”; “since MATor is an ongoing project, we would appreciate your opinion about the approach in general.”\n\nTor help desk roundup\n\nThe help desk has been asked if Tor Browser acts as a relay by default. Tor Browser’s Tor by default acts only as a client, and not as a bridge relay, exit relay, or relay. Additionally, this is unlikely to change in the future.\n\n\n\nThis issue of Tor Weekly News has been assembled by Lunar, Matt Pagan, Karsten Loesing, and Harmony.\n\nWant to continue reading TWN? Please help us create this newsletter. We still need more volunteers to watch the Tor community and report important news. Please see the project page, write down your name and subscribe to the team mailing list if you want to get involved!\n",
            "link": "http://tor.jmtodaro.com//tor-weekly-news-—-november-5th-2014",
            "date": "2014-11-05 01:00:00 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor Browser 4.0.1 is released",
            "content": "A bugfix release for the latest stable Tor Browser is available from the Tor Browser Project page and also from our distribution directory.\n\nMost notably, Tor Browser 4.0.1 fixes a crash bug affecting many users on Windows (see: bug 13443 for the details). Furthermore, the latest stable version of Tor (0.2.5.10) is included and a bug in our updater code got fixed.\n\nThis is not a security update, and we will not be deploying update notification or automatic upgrades for all platforms for this release. We may provide automatic updates just for Windows users later in the week, but we are hesitant to do this immediately due to Bug 13594.\n\nHere is the changelog since 4.0:\n\n\n  All Platforms\n\n\n  Update Tor to 0.2.5.10\n  Update NoScript to 2.6.9.3\n\n\n  Bug 13301: Prevent extensions incompatibility error after upgrades\n  Bug 13460: Fix MSVC compilation issue\n\n\n  Windows\n\n\n  Bug 13443: Disable DirectShow to prevent crashes on many sites\n  Bug 13091: Make app name &quot;Tor Browser&quot; instead of &quot;Tor&quot;\n\n\n",
            "link": "http://tor.jmtodaro.com//tor-browser-401-released",
            "date": "2014-10-31 15:42:00 -0500",
            "excerpt": null
        }
    

    
        ,{
            "title": "Facebook, hidden services, and https certs",
            "content": "Today Facebook unveiled its hidden service that lets users access their website more safely. Users and journalists have been asking for our response; here are some points to help you understand our thinking.\n\nPart one: yes, visiting Facebook over Tor is not a contradiction\n\nI didn&#39;t even realize I should include this section, until I heard from a journalist today who hoped to get a quote from me about why Tor users wouldn&#39;t ever use Facebook. Putting aside the (still very important) questions of Facebook&#39;s privacy habits, their harmful real-name policies, and whether you should or shouldn&#39;t tell them anything about you, the key point here is that anonymity isn&#39;t just about hiding from your destination.\n\nThere&#39;s no reason to let your ISP know when or whether you&#39;re visiting Facebook. There&#39;s no reason for Facebook&#39;s upstream ISP, or some agency that surveils the Internet, to learn when and whether you use Facebook. And if you do choose to tell Facebook something about you, there&#39;s still no reason to let them automatically discover what city you&#39;re in today while you do it.\n\nAlso, we should remember that there are some places in the world that can&#39;t reach Facebook. Long ago I talked to a Facebook security person who told me a fun story. When he first learned about Tor, he hated and feared it because it &quot;clearly&quot; intended to undermine their business model of learning everything about all their users. Then suddenly Iran blocked Facebook, a good chunk of the Persian Facebook population switched over to reaching Facebook via Tor, and he became a huge Tor fan because otherwise those users would have been cut off. Other countries like China followed a similar pattern after that. This switch in his mind between &quot;Tor as a privacy tool to let users control their own data&quot; to &quot;Tor as a communications tool to give users freedom to choose what sites they visit&quot; is a great example of the diversity of uses for Tor: whatever it is you think Tor is for, I guarantee there&#39;s a person out there who uses it for something you haven&#39;t considered.\n\nPart two: we&#39;re happy to see broader adoption of hidden services\n\nI think it is great for Tor that Facebook has added a .onion address. There are some compelling use cases for hidden services: see for example the ones described at using Tor hidden services for good, as well as upcoming decentralized chat tools like Ricochet where every user is a hidden service, so there&#39;s no central point to tap or lean on to retain data. But we haven&#39;t really publicized these examples much, especially compared to the publicity that the &quot;I have a website that the man wants to shut down&quot; examples have gotten in recent years.\n\nHidden services provide a variety of useful security properties. First — and the one that most people think of — because the design uses Tor circuits, it&#39;s hard to discover where the service is located in the world. But second, because the address of the service is the hash of its key, they are self-authenticating: if you type in a given .onion address, your Tor client guarantees that it really is talking to the service that knows the private key that corresponds to the address. A third nice feature is that the rendezvous process provides end-to-end encryption, even when the application-level traffic is unencrypted.\n\nSo I am excited that this move by Facebook will help to continue opening people&#39;s minds about why they might want to offer a hidden service, and help other people think of further novel uses for hidden services.\n\nAnother really nice implication here is that Facebook is committing to taking its Tor users seriously. Hundreds of thousands of people have been successfully using Facebook over Tor for years, but in today&#39;s era of services like Wikipedia choosing not to accept contributions from users who care about privacy, it is refreshing and heartening to see a large website decide that it&#39;s ok for their users to want more safety.\n\nAs an addendum to that optimism, I would be really sad if Facebook added a hidden service, had a few problems with trolls, and decided that they should prevent Tor users from using their old https://www.facebook.com/ address. So we should be vigilant in helping Facebook continue to allow Tor users to reach them through either address.\n\nPart three: their vanity address doesn&#39;t mean the world has ended\n\nTheir hidden service name is &quot;facebookcorewwwi.onion&quot;. For a hash of a public key, that sure doesn&#39;t look random. Many people have been wondering how they brute forced the entire name.\n\nThe short answer is that for the first half of it (&quot;facebook&quot;), which is only 40 bits, they generated keys over and over until they got some keys whose first 40 bits of the hash matched the string they wanted.\n\nThen they had some keys whose name started with &quot;facebook&quot;, and they looked at the second half of each of them to pick out the ones with pronouncable and thus memorable syllables. The &quot;corewwwi&quot; one looked best to them — meaning they could come up with a story about why that&#39;s a reasonable name for Facebook to use — so they went with it.\n\nSo to be clear, they would not be able to produce exactly this name again if they wanted to. They could produce other hashes that start with &quot;facebook&quot; and end with pronouncable syllables, but that&#39;s not brute forcing all of the hidden service name (all 80 bits).\n\nFor those who want to explore the math more, read about the &quot;birthday attack&quot;. And for those who want to learn more (please help!) about the improvements we&#39;d like to make for hidden services, including stronger keys and stronger names, see hidden services need some love and Tor proposal 224.\n\nPart four: what do we think about an https cert for a .onion address?\n\nFacebook didn&#39;t just set up a hidden service. They also got an https certificate for their hidden service, and it&#39;s signed by Digicert so your browser will accept it. This choice has produced some feisty discussions in the CA/Browser community, which decides what kinds of names can get official certificates. That discussion is still ongoing, but here are my early thoughts on it.\n\nIn favor: we, the Internet security community, have taught people that https is necessary and http is scary. So it makes sense that users want to see the string &quot;https&quot; in front of them.\n\nAgainst: Tor&#39;s .onion handshake basically gives you all of that for free, so by encouraging people to pay Digicert we&#39;re reinforcing the CA business model when maybe we should be continuing to demonstrate an alternative.\n\nIn favor: Actually https does give you a little bit more, in the case where the service (Facebook&#39;s webserver farm) isn&#39;t in the same location as the Tor program. Remember that there&#39;s no requirement for the webserver and the Tor process to be on the same machine, and in a complicated set-up like Facebook&#39;s they probably shouldn&#39;t be. One could argue that this last mile is inside their corporate network, so who cares if it&#39;s unencrypted, but I think the simple phrase &quot;ssl added and removed here&quot; will kill that argument.\n\nAgainst: if one site gets a cert, it will further reinforce to users that it&#39;s &quot;needed&quot;, and then the users will start asking other sites why they don&#39;t have one. I worry about starting a trend where you need to pay Digicert money to have a hidden service or your users think it&#39;s sketchy — especially since hidden services that value their anonymity could have a hard time getting a certificate.\n\nOne alternative would be to teach Tor Browser that https .onion addresses don&#39;t deserve a scary pop-up warning. A more thorough approach in that direction is to have a way for a hidden service to generate its own signed https cert using its onion private key, and teach Tor Browser how to verify them — basically a decentralized CA for .onion addresses, since they are self-authenticating anyway. Then you don&#39;t have to go through the nonsense of pretending to see if they could read email at the domain, and generally furthering the current CA model.\n\nWe could also imagine a pet name model where the user can tell her Tor Browser that this .onion address &quot;is&quot; Facebook. Or the more direct approach would be to ship a bookmark list of &quot;known&quot; hidden services in Tor Browser — like being our own CA, using the old-fashioned /etc/hosts model. That approach would raise the political question though of which sites we should endorse in this way.\n\nSo I haven&#39;t made up my mind yet about which direction I think this discussion should go. I&#39;m sympathetic to &quot;we&#39;ve taught the users to check for https, so let&#39;s not confuse them&quot;, but I also worry about the slippery slope where getting a cert becomes a required step to having a reputable service. Let us know if you have other compelling arguments for or against.\n\nPart five: what remains to be done?\n\nIn terms of both design and security, hidden services still need some love. We have plans for improved designs (see Tor proposal 224) but we don&#39;t have enough funding and developers to make it happen. We&#39;ve been talking to some Facebook engineers this week about hidden service reliability and scalability, and we&#39;re excited that Facebook is thinking of putting development effort into helping improve hidden services.\n\nAnd finally, speaking of teaching people about the security features of .onion sites, I wonder if &quot;hidden services&quot; is no longer the best phrase here. Originally we called them &quot;location-hidden services&quot;, which was quickly shortened in practice to just &quot;hidden services&quot;. But protecting the location of the service is just one of the security features you get. Maybe we should hold a contest to come up with a new name for these protected services? Even something like &quot;onion services&quot; might be better if it forces people to learn what it is.\n",
            "link": "http://tor.jmtodaro.com//facebook-hidden-services-and-https-certs",
            "date": "2014-10-31 15:09:20 -0500",
            "excerpt": null
        }
    

    
        ,{
            "title": "Roger doing invited talk at Real World Crypto in London",
            "content": "http://www.realworldcrypto.com/rwc2015\n",
            "link": "http://tor.jmtodaro.com//events/roger-doing-invited-talk-real-world-crypto-london",
            "date": "2014-10-24 16:35:32 -0500",
            "excerpt": null
        }
    

    
        ,{
            "title": "Roger, Jake, many others at 31c3 in Hamburg",
            "content": "http://events.ccc.de/2014/07/12/31c3-call-for-participation-en/\n",
            "link": "http://tor.jmtodaro.com//events/roger-jake-many-others-31c3-hamburg",
            "date": "2014-10-24 16:34:34 -0500",
            "excerpt": null
        }
    

    
        ,{
            "title": "Roger at WPES and CCS in Phoenix",
            "content": "https://www.cylab.cmu.edu/news_events/events/wpes2014/\n http://www.sigsac.org/ccs/CCS2014/\n",
            "link": "http://tor.jmtodaro.com//events/roger-wpes-and-ccs-phoenix",
            "date": "2014-10-24 16:33:11 -0500",
            "excerpt": null
        }
    

    
        ,{
            "title": "Roger @ ISCI “1984+30” panel, UC Berkeley",
            "content": "The International Computer Science Institute of UC Berkeley is organizing a day of discussions: 1984+30: Navigating Privacy Threats and Protections in the Digital Age on October 6th.\n",
            "link": "http://tor.jmtodaro.com//events/roger-isci-“198430”-panel-uc-berkeley",
            "date": "2014-09-05 21:59:10 -0500",
            "excerpt": null
        }
    

    
        ,{
            "title": "Andrew Keynotes Broadband World Forum",
            "content": "Andrew delivering keynote address at Broadband World Forum\n",
            "link": "http://tor.jmtodaro.com//events/andrew-keynotes-broadband-world-forum",
            "date": "2014-08-06 15:59:08 -0500",
            "excerpt": null
        }
    

    
        ,{
            "title": "Roger @ FOCI ’14, San Diego, CA",
            "content": "Roger Dingledine will attend the 4th USENIX Workshop on Free and Open Communications on the Internet in San Diego, California, USA.\n",
            "link": "http://tor.jmtodaro.com//events/roger-foci-’14-san-diego-ca",
            "date": "2014-07-23 23:18:58 -0500",
            "excerpt": null
        }
    

    
        ,{
            "title": "Researchers & Practitioners Meetup @ PETS, Amsterdam",
            "content": "We have arranged for two rooms near the venue of PETS for an &quot;unconference&quot; around practical applications of privacy technology on the day before the symposium begins.\n",
            "link": "http://tor.jmtodaro.com//events/researchers-practitioners-meetup-pets-amsterdam",
            "date": "2014-06-24 23:49:51 -0500",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor @ 35th IEEE Symposium on Security and Privacy, San Jose, CA",
            "content": "Roger Dingledine, Ian Goldberg and other members of the larger Tor community will attend the 35th IEEE Symposium on Security and Privacy held in San Jose, California, USA.\n",
            "link": "http://tor.jmtodaro.com//events/tor-35th-ieee-symposium-security-and-privacy-san-josa-ca",
            "date": "2014-05-13 00:34:21 -0500",
            "excerpt": null
        }
    

    
        ,{
            "title": "Lunar @ LSM 2014, Montpellier, France",
            "content": "Lunar will attend the 15th Libre Software Meeting in Montpellier, France.\n",
            "link": "http://tor.jmtodaro.com//events/lunar-lsm-2014-montpellier-france",
            "date": "2014-05-12 00:02:28 -0500",
            "excerpt": null
        }
    

    
        ,{
            "title": "Colin Childs Presenting Tor @ CryptoParty, Winnipeg",
            "content": "Join host Colin Childs at the Winnipeg Cryptoparty. Presenters Colin Child&#39;s and others (TBD) will cover Anonymity Tools (Tor) and Secure Communication Tools (GnuPG, OTR)\n",
            "link": "http://tor.jmtodaro.com//events/colin-childs-presenting-tor-cryptoparty-winnipeg-0",
            "date": "2014-05-09 05:50:00 -0500",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor's Summer Dev Meeting - Paris, France",
            "content": "Tor&#39;s Summer 2014 Developers Meeting is being hosted by Mozilla in Paris, France.\n",
            "link": "http://tor.jmtodaro.com//events/tors-summer-dev-meeting-paris-france",
            "date": "2014-05-05 04:26:03 -0500",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor @ Stockholm Internet Forum",
            "content": "Tor at Stockholm Internet Forum\n",
            "link": "http://tor.jmtodaro.com//events/tor-stockholm-internet-forum",
            "date": "2014-04-17 08:22:51 -0500",
            "excerpt": null
        }
    

    
        ,{
            "title": "Kelley @ Women in Cyber Security Conference, Nashville, TN",
            "content": "Kelley will be attending and participating on a panel at the Women in Cyber Security Conference. The conference is being held in Nashville, TN on April 11 and 12.\n",
            "link": "http://tor.jmtodaro.com//events/kelley-women-cyber-security-conference-nashville-tn",
            "date": "2014-03-28 08:14:13 -0500",
            "excerpt": null
        }
    

    
        ,{
            "title": "Kelley @ CERIAS Symposium, Purdue University",
            "content": "Kelley will be attending the annual The Center for Education and Research in Information Assurance and Security (CERIAS) symposium at Purdue University, Wednesday, March 26 and Thursday, March 27.\n",
            "link": "http://tor.jmtodaro.com//events/kelley-cerias-symposium-purdue-university",
            "date": "2014-03-24 06:10:35 -0500",
            "excerpt": null
        }
    

    
        ,{
            "title": "Civil Rights Defenders, Defender's Days",
            "content": "Andrew and Jacob at Civil Rights Defenders, Defender&#39;s Days.\n",
            "link": "http://tor.jmtodaro.com//events/civil-rights-defenders-defenders-days",
            "date": "2014-03-21 12:31:18 -0500",
            "excerpt": null
        }
    

    
        ,{
            "title": "Andrew @ Boston Network Users Group Meeting",
            "content": "Andrew presenting Tor at the Boston Network Users Group held at the Microsoft Store in the Burlington Mall. See http://www.bnug.org/ for more details.\n",
            "link": "http://tor.jmtodaro.com//events/andrew-boston-network-users-group-meeting",
            "date": "2014-03-03 04:14:38 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Karen and Kelley @ SXSW, Austin, TX",
            "content": "Karen and Kelley will attending SXSW 2014 in Austin, TX. You can see Karen present\n Tips &amp; Tools for Protected Connection on Tuesday, March 11th or visit us at the Knight Foundation booth in the Exhibitors Hall.\n",
            "link": "http://tor.jmtodaro.com//events/karen-and-kelley-sxsw-austin-tx",
            "date": "2014-02-25 07:41:36 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Kelley @ 2014 CAR Conference, Baltimore",
            "content": "Kelley will be presenting digital safety for journalists at the 2014 CAR conference in Baltimore, MD, Saturday, March 1 starting at 10:00 am.\n",
            "link": "http://tor.jmtodaro.com//events/kelley-2014-car-conference-baltimore",
            "date": "2014-02-25 07:38:17 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Andrew at Boston/Cambridge Countersurveillance DiscoTech",
            "content": "The Civic Media: Codesign Studio team (codesign.mit.edu) is organizing and hosting a countersurveillance DiscoTech (short for “Discovering Technology”) on March 1st and 2nd, 2014, at the MIT Media Lab. A DiscoTech is a workshop for people of all skill levels to learn about a set of technologies.\n",
            "link": "http://tor.jmtodaro.com//events/andrew-bostoncambridge-countersurveillance-discotech",
            "date": "2014-02-24 16:27:12 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor @ LibrePlanet 2014, MIT, Cambridge, MA",
            "content": "Come check out the Tor Project booth and meet members of our global team at LibrePlanet 2014 on March 22nd-23rd 2014, MIT, Cambridge, MA.\n",
            "link": "http://tor.jmtodaro.com//events/tor-libreplanet-2014-mit-cambridge-ma",
            "date": "2014-02-10 03:19:55 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Privacy SOS CryptoParty at NorthEastern University in Boston",
            "content": "Learn more, http://privacysos.org/party\n",
            "link": "http://tor.jmtodaro.com//events/privacy-sos-cryptoparty-northeastern-university-boston",
            "date": "2014-01-28 05:42:53 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor Presenting @ New Media Inspiration 2014, Prague, Czech Republic",
            "content": "Aaron Gibson will be presenting a talk at the New Media Inspiration 2014 conference in Prague on February 8, 2014.\n",
            "link": "http://tor.jmtodaro.com//events/tor-presenting-new-media-inspiration-2014-prague-czech-republic",
            "date": "2014-01-20 03:58:28 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Colin Childs Presenting Tor @ CryptoParty, Winnipeg",
            "content": "Colin Childs is hosting and presenting at the Winnipeg CryptoParty on February 8, 2014. The focus will be on installing and using anonymity and secure communication tools including Tor.\n",
            "link": "http://tor.jmtodaro.com//events/colin-childs-presenting-tor-cryptoparty-winnipeg",
            "date": "2014-01-20 03:53:58 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor's Winter 2014 Developers Meeting, Reykjavik, Iceland",
            "content": "The Tor Project will be having it&#39;s bi-annual Developers Meeting and Hack Day Events in the beautiful city of Reykjavik, Iceland February 17 thru 21, 2014.\n",
            "link": "http://tor.jmtodaro.com//events/tors-winter-2014-developers-meeting-reykjavik-iceland",
            "date": "2014-01-16 04:14:00 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Roger @ Usenix Security Symposium, San Diego, CA",
            "content": "Roger will be attending the Usenix Security Symposium August 20-22, 2014 in San Diego, CA. The USENIX Security Symposium brings together researchers, practitioners, system administrators, system programmers, and others interested in the latest advances in the security of computer systems and networks.\n",
            "link": "http://tor.jmtodaro.com//events/roger-usenix-security-symposium-san-diego-ca",
            "date": "2014-01-06 04:08:52 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor @ PETS 2014, Amsterdam",
            "content": "Roger and members of the Tor team will be attending PETS 2014 in Amsterdam, July 16 - 18, 2014. The 14th Privacy Enhancing Technologies Symposium (PETS) addresses the design and realization of privacy services for the Internet and other data systems and communication networks by bringing together anonymity and privacy experts from around the world to discuss recent advances and new perspectives.\n",
            "link": "http://tor.jmtodaro.com//events/tor-pets-2014-amsterdam",
            "date": "2014-01-06 04:05:58 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Roger @ George Mason University, Washington, DC",
            "content": "Roger will be speaking at George Mason University, Research Hall, Room 163, on April 11, 2014. Invited by the Department of Computer Science Roger will discuss &quot;Tor and Censorship: Lessons Learned&quot;.\n",
            "link": "http://tor.jmtodaro.com//events/roger-george-mason-university-washington-dc",
            "date": "2014-01-06 04:02:01 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor @ Financial Crypto 2014, Barbados",
            "content": "Roger Dingledine and Nick Hopper will be attending the Financial Cryptopraphy and Data Security Conference, March 3 - 7, 2014 in Barbados. Financial Cryptography and Data Security is a major international forum for research, advanced development, education, exploration, and debate regarding information assurance, with a specific focus on commercial contexts.\n",
            "link": "http://tor.jmtodaro.com//events/tor-financial-crypto-2014-barbados",
            "date": "2014-01-06 03:57:56 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Roger @ NSF WATCH Seminar Series, Arlington, VA",
            "content": "Roger will be speaking at the The Washington Area Trustworthy Computing Hour (WATCH) seminar series on January 14, 2014 in Arlington VA. The series is jointly organized by NSF’s Computer Science and Engineering (CISE) and Social, Behavioral, and Economic (SBE) Directorates and the Office of Cyberinfrastructure (OCI), and sponsored by the CISE Trustworthy Computing Program.\n",
            "link": "http://tor.jmtodaro.com//events/roger-nsf-watch-seminar-series-arlington-va",
            "date": "2014-01-06 03:21:22 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor @ FOSDEM, Brussels",
            "content": "Lunar will be attending FOSDEM in Brussels, February 1-2, 2014. FOSDEM is a free event that offers open source communities a place to meet, share ideas and collaborate.\n",
            "link": "http://tor.jmtodaro.com//events/tor-fosdem-brussels",
            "date": "2014-01-06 03:15:27 -0600",
            "excerpt": null
        }
    

    
        ,{
            "title": "Tor @ Real World Crypto 2014, New York City, USA",
            "content": "Several members of the Tor project will attend the Real World Cryptography workshop 2014.\n",
            "link": "http://tor.jmtodaro.com//events/tor-real-world-crypto-2014-new-york-city-usa",
            "date": "2013-12-20 12:38:11 -0600",
            "excerpt": null
        }
    



    

    

    

    
        ,{
            "title": "Archives",
            "content": "{% for post in site.posts %}    {% capture month %}{{ post.date | date: '%m%Y' }}{% endcapture %}    {% capture nmonth %}{{ post.next.date | date: '%m%Y' }}{% endcapture %}        {% if month != nmonth %}            {% if forloop.index != 1 %}{% endif %}            {{ post.date | date: '%B %Y' }}        {% endif %}    {{ post.title }}    {{ post.date | date: \"%e %B %Y\" }}{% endfor %}",
            "link": "http://tor.jmtodaro.com//archive/",
            "date": null,
            "excerpt": null
        }
    

    

    
        ,{
            "title": "Events",
            "content": "  Events      {% for post in site.categories.event %}                         {{ post.title | xml_escape }}                        {{ post.startdate | date: \"%-d %B %Y\" }}              {% if post.enddate %}                to {{ post.enddate | date: \"%-d %B %Y\" }}              {% endif %}                                    {{ post.content }}                  {% endfor %}  ",
            "link": "http://tor.jmtodaro.com//events/",
            "date": null,
            "excerpt": null
        }
    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

]
